// WidgetBlueprintGeneratedClass AgentInventory.AgentInventory_C
// Size: 0x7e0 (Inherited: 0x558)
struct UAgentInventory_C : UPDAgentInventoryUI {
	struct UWidgetAnimation* Anim_SceneOut_Confirm; // 0x558(0x08)
	struct UWidgetAnimation* Anim_CustomFocus_Loop; // 0x560(0x08)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x568(0x08)
	struct UWidgetAnimation* Anim_FocusShowUp; // 0x570(0x08)
	struct UImage* IMG_ActiveBarDeco; // 0x578(0x08)
	struct UImage* IMG_AgentFocus_Deco_LB; // 0x580(0x08)
	struct UImage* IMG_AgentFocus_Deco_LT; // 0x588(0x08)
	struct UImage* IMG_AgentFocus_Deco_RB; // 0x590(0x08)
	struct UImage* IMG_AgentFocus_Deco_RT; // 0x598(0x08)
	struct UImage* IMG_AgentFocus_Deco_Ruler; // 0x5a0(0x08)
	struct UImage* IMG_AgentSign_Underbar; // 0x5a8(0x08)
	struct UImage* IMG_CustomAgent_Decco_LB; // 0x5b0(0x08)
	struct UImage* IMG_CustomAgent_Decco_LT; // 0x5b8(0x08)
	struct UImage* IMG_CustomAgent_Decco_RB; // 0x5c0(0x08)
	struct UImage* IMG_CustomAgent_Decco_RT; // 0x5c8(0x08)
	struct UImage* IMG_CustomAgent_Deco01; // 0x5d0(0x08)
	struct UImage* IMG_CustomAgent_Deco02; // 0x5d8(0x08)
	struct UImage* IMG_CustomAgent_Deco03; // 0x5e0(0x08)
	struct UImage* IMG_CustomAgent_Deco03_Fx; // 0x5e8(0x08)
	struct UImage* IMG_CustomGame_Decco_LB; // 0x5f0(0x08)
	struct UImage* IMG_CustomGame_Decco_LT; // 0x5f8(0x08)
	struct UImage* IMG_CustomGame_Decco_RB; // 0x600(0x08)
	struct UImage* IMG_CustomGame_Decco_RT; // 0x608(0x08)
	struct UImage* IMG_CustomGame_Deco01; // 0x610(0x08)
	struct UImage* IMG_CustomGame_Deco02; // 0x618(0x08)
	struct UImage* IMG_CustomGame_Deco03; // 0x620(0x08)
	struct UImage* IMG_CustomGame_Deco03_Fx; // 0x628(0x08)
	struct UImage* IMG_CustomWeapon_Decco_LB; // 0x630(0x08)
	struct UImage* IMG_CustomWeapon_Decco_LT; // 0x638(0x08)
	struct UImage* IMG_CustomWeapon_Decco_RB; // 0x640(0x08)
	struct UImage* IMG_CustomWeapon_Decco_RT; // 0x648(0x08)
	struct UImage* IMG_CustomWeapon_Deco01; // 0x650(0x08)
	struct UImage* IMG_CustomWeapon_Deco02; // 0x658(0x08)
	struct UImage* IMG_CustomWeapon_Deco03; // 0x660(0x08)
	struct UImage* IMG_CustomWeapon_Deco03_Fx; // 0x668(0x08)
	struct UImage* IMG_Outglow_Agent; // 0x670(0x08)
	struct UImage* IMG_QuickDeco_Bottom_Normal; // 0x678(0x08)
	struct UImage* IMG_QuickDeco_Bottom_Over; // 0x680(0x08)
	struct UImage* IMG_QuickDeco_LB_Normal; // 0x688(0x08)
	struct UImage* IMG_QuickDeco_LB_Over; // 0x690(0x08)
	struct UImage* IMG_QuickDeco_LT_Normal; // 0x698(0x08)
	struct UImage* IMG_QuickDeco_LT_Over; // 0x6a0(0x08)
	struct UImage* IMG_QuickDeco_RB_Normal; // 0x6a8(0x08)
	struct UImage* IMG_QuickDeco_RB_Over; // 0x6b0(0x08)
	struct UImage* IMG_QuickDeco_RT_Normal; // 0x6b8(0x08)
	struct UImage* IMG_QuickDeco_RT_Over; // 0x6c0(0x08)
	struct UImage* IMG_QuickDeco_Top_Normal; // 0x6c8(0x08)
	struct UImage* IMG_QuickDeco_Top_Over; // 0x6d0(0x08)
	struct UImage* IMG_Rental_Alert; // 0x6d8(0x08)
	struct UImage* IMG_Rental_Bg; // 0x6e0(0x08)
	struct UImage* IMG_Rental_Outline; // 0x6e8(0x08)
	struct UImage* IMG_SCLDeco_Arrow_Normal; // 0x6f0(0x08)
	struct UImage* IMG_SCLDeco_Arrow_Over; // 0x6f8(0x08)
	struct UImage* IMG_SCLDeco_Bottom_Normal; // 0x700(0x08)
	struct UImage* IMG_SCLDeco_Bottom_Over; // 0x708(0x08)
	struct UImage* IMG_SCLDeco_LB_Normal; // 0x710(0x08)
	struct UImage* IMG_SCLDeco_LB_Over; // 0x718(0x08)
	struct UImage* IMG_SCLDeco_LT_Normal; // 0x720(0x08)
	struct UImage* IMG_SCLDeco_LT_Over; // 0x728(0x08)
	struct UImage* IMG_SCLDeco_RB_Normal; // 0x730(0x08)
	struct UImage* IMG_SCLDeco_RB_Over; // 0x738(0x08)
	struct UImage* IMG_SCLDeco_RT_Normal; // 0x740(0x08)
	struct UImage* IMG_SCLDeco_RT_Over; // 0x748(0x08)
	struct UImage* IMG_SCLDeco_Top_Normal; // 0x750(0x08)
	struct UImage* IMG_SCLDeco_Top_Over; // 0x758(0x08)
	struct UImage* IMG_SCRDeco_Arrow_Normal; // 0x760(0x08)
	struct UImage* IMG_SCRDeco_Arrow_Over; // 0x768(0x08)
	struct UImage* IMG_SCRDeco_Bottom_Normal; // 0x770(0x08)
	struct UImage* IMG_SCRDeco_Bottom_Over; // 0x778(0x08)
	struct UImage* IMG_SCRDeco_LB_Normal; // 0x780(0x08)
	struct UImage* IMG_SCRDeco_LB_Over; // 0x788(0x08)
	struct UImage* IMG_SCRDeco_LT_Normal; // 0x790(0x08)
	struct UImage* IMG_SCRDeco_LT_Over; // 0x798(0x08)
	struct UImage* IMG_SCRDeco_RB_Normal; // 0x7a0(0x08)
	struct UImage* IMG_SCRDeco_RB_Over; // 0x7a8(0x08)
	struct UImage* IMG_SCRDeco_RT_Normal; // 0x7b0(0x08)
	struct UImage* IMG_SCRDeco_RT_Over; // 0x7b8(0x08)
	struct UImage* IMG_SCRDeco_Top_Normal; // 0x7c0(0x08)
	struct UImage* IMG_SCRDeco_Top_Over; // 0x7c8(0x08)
	struct UImage* IMG_TitleActiveBar; // 0x7d0(0x08)
	struct UWidgetSwitcher* WS_QuickContract; // 0x7d8(0x08)
};

