// WidgetBlueprintGeneratedClass AgentLeptonInfo.AgentLeptonInfo_C
// Size: 0x3f8 (Inherited: 0x360)
struct UAgentLeptonInfo_C : UPDAgentLeptonInfo {
	struct UImage* IMG_AgentName_Deco; // 0x360(0x08)
	struct UImage* IMG_BackBoard; // 0x368(0x08)
	struct UImage* IMG_Divider; // 0x370(0x08)
	struct UImage* IMG_EquipSlot_Locked1; // 0x378(0x08)
	struct UImage* IMG_EquipSlot_Locked2; // 0x380(0x08)
	struct UImage* IMG_EquipSlot_Locked3; // 0x388(0x08)
	struct UImage* IMG_EquipSlot_UnEquipped_2; // 0x390(0x08)
	struct UImage* IMG_EquipSlot_UnEquipped1; // 0x398(0x08)
	struct UImage* IMG_EquipSlot_UnEquipped3; // 0x3a0(0x08)
	struct UImage* IMG_MainMission_Deco; // 0x3a8(0x08)
	struct UImage* IMG_ModeName_Deco; // 0x3b0(0x08)
	struct UImage* IMG_PopupBoard; // 0x3b8(0x08)
	struct UImage* IMG_Signature_Guide; // 0x3c0(0x08)
	struct UPDKeyButton_C* KBtn_Close; // 0x3c8(0x08)
	struct UPersonalMissionModule_C* PersonalMissionModule; // 0x3d0(0x08)
	struct UPersonalMissionModule_C* PersonalMissionModule_2; // 0x3d8(0x08)
	struct UPersonalMissionModule_C* PersonalMissionModule_3; // 0x3e0(0x08)
	struct UPersonalMissionModule_C* PersonalMissionModule_4; // 0x3e8(0x08)
	struct UPersonalMissionModule_C* PersonalMissionModule_5; // 0x3f0(0x08)
};

