// WidgetBlueprintGeneratedClass AgentSlotListItem.AgentSlotListItem_C
// Size: 0x408 (Inherited: 0x318)
struct UAgentSlotListItem_C : UPDAgentSlotListItemUI {
	struct UWidgetAnimation* Anim_OverSelect_Loop; // 0x318(0x08)
	struct UImage* IMG_CharacterSlot_Divider_01; // 0x320(0x08)
	struct UImage* IMG_CharacterSlot_Divider_02; // 0x328(0x08)
	struct UImage* IMG_CharacterSlot_Outline; // 0x330(0x08)
	struct UImage* IMG_CharacterSlot_OverDivider_01; // 0x338(0x08)
	struct UImage* IMG_CharacterSlot_OverDivider_02; // 0x340(0x08)
	struct UImage* IMG_CharacterSlot_OverOutline; // 0x348(0x08)
	struct UImage* IMG_CharacterSlot_PortraitBg; // 0x350(0x08)
	struct UImage* IMG_CharacterSlot_PortraitDeco; // 0x358(0x08)
	struct UImage* IMG_CharacterSlot_PortraitOutline; // 0x360(0x08)
	struct UImage* IMG_CharacterSlot_SelectDivider_01; // 0x368(0x08)
	struct UImage* IMG_CharacterSlot_SelectDivider_02; // 0x370(0x08)
	struct UImage* IMG_CharacterSlot_SelectOutline; // 0x378(0x08)
	struct UImage* IMG_Empty_Divider_01; // 0x380(0x08)
	struct UImage* IMG_Empty_Divider_02; // 0x388(0x08)
	struct UImage* IMG_Empty_Outline; // 0x390(0x08)
	struct UImage* IMG_Empty_OverDivider_01; // 0x398(0x08)
	struct UImage* IMG_Empty_OverDivider_02; // 0x3a0(0x08)
	struct UImage* IMG_Empty_OverOutline; // 0x3a8(0x08)
	struct UImage* IMG_Empty_Portrait; // 0x3b0(0x08)
	struct UImage* IMG_Empty_PortraitBg; // 0x3b8(0x08)
	struct UImage* IMG_Empty_PortraitDeco; // 0x3c0(0x08)
	struct UImage* IMG_Empty_PortraitOutline; // 0x3c8(0x08)
	struct UImage* IMG_Expired_Bg; // 0x3d0(0x08)
	struct UImage* IMG_Expired_Deco; // 0x3d8(0x08)
	struct UImage* IMG_OverDeco_LB; // 0x3e0(0x08)
	struct UImage* IMG_OverDeco_LT; // 0x3e8(0x08)
	struct UImage* IMG_OverDeco_RB; // 0x3f0(0x08)
	struct UImage* IMG_OverDeco_RT; // 0x3f8(0x08)
	struct UImage* IMG_SLotBg; // 0x400(0x08)
};

