// WidgetBlueprintGeneratedClass AgentLobby.AgentLobby_C
// Size: 0x5b8 (Inherited: 0x378)
struct UAgentLobby_C : UPDLobbyUI {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x378(0x08)
	struct UWidgetAnimation* Anim_SceneOut; // 0x380(0x08)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x388(0x08)
	struct UImage* IMG_BtnBg_Disabled; // 0x390(0x08)
	struct UImage* IMG_BtnBg_Hover; // 0x398(0x08)
	struct UImage* IMG_BtnBg_Matching; // 0x3a0(0x08)
	struct UImage* IMG_BtnBg_Normal; // 0x3a8(0x08)
	struct UImage* IMG_BtnDeco_Matching01; // 0x3b0(0x08)
	struct UImage* IMG_BtnDeco_Matching02; // 0x3b8(0x08)
	struct UImage* IMG_BtnDeco_Matching03; // 0x3c0(0x08)
	struct UImage* IMG_BtnDeco_Matching04; // 0x3c8(0x08)
	struct UImage* IMG_BtnDeco_Matching05; // 0x3d0(0x08)
	struct UImage* IMG_BtnDeco_Matching06; // 0x3d8(0x08)
	struct UImage* IMG_BtnDeco_Matching07; // 0x3e0(0x08)
	struct UImage* IMG_BtnDeco_Matching08; // 0x3e8(0x08)
	struct UImage* IMG_BtnDeco_Matching09; // 0x3f0(0x08)
	struct UImage* IMG_BtnDeco_Matching10; // 0x3f8(0x08)
	struct UImage* IMG_BtnDeco_Matching11; // 0x400(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn01_Disabled; // 0x408(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn01_Hover; // 0x410(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn01_Normal; // 0x418(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn02_Disabled; // 0x420(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn02_Hover; // 0x428(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn02_Normal; // 0x430(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn03_Disabled; // 0x438(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn03_Hover; // 0x440(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn03_Normal; // 0x448(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn04_Disabled; // 0x450(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn04_Hover; // 0x458(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn04_Normal; // 0x460(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn05_Disabled; // 0x468(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn05_Hover; // 0x470(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn05_Normal; // 0x478(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn06_Disabled; // 0x480(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn06_Hover; // 0x488(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn06_Normal; // 0x490(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn07_Disabled; // 0x498(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn07_Hover; // 0x4a0(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn07_Normal; // 0x4a8(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn08_Disabled; // 0x4b0(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn08_Hover; // 0x4b8(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn08_Normal; // 0x4c0(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn09_Disabled; // 0x4c8(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn09_Hover; // 0x4d0(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn09_Normal; // 0x4d8(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn10_Disabled; // 0x4e0(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn10_Hover; // 0x4e8(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn10_Normal; // 0x4f0(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn11_Disabled; // 0x4f8(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn11_Hover; // 0x500(0x08)
	struct UImage* IMG_BtnDeco_PlayBtn11_Normal; // 0x508(0x08)
	struct UImage* IMG_BtnDot_Matching; // 0x510(0x08)
	struct UImage* IMG_BtnDot_PlayBtn_Disabled; // 0x518(0x08)
	struct UImage* IMG_BtnDot_PlayBtn_Hover; // 0x520(0x08)
	struct UImage* IMG_BtnDot_PlayBtn_Normal; // 0x528(0x08)
	struct UImage* IMG_Disabled_ReasonBg; // 0x530(0x08)
	struct UImage* IMG_Glow_Matching; // 0x538(0x08)
	struct UImage* IMG_Glow_Matching2; // 0x540(0x08)
	struct UImage* IMG_Glow_Matching3; // 0x548(0x08)
	struct UImage* IMG_Glow_Matching4; // 0x550(0x08)
	struct UImage* IMG_Glow_PlayBtn_Hover; // 0x558(0x08)
	struct UImage* IMG_Glow_PlayBtn_Hover2; // 0x560(0x08)
	struct UImage* IMG_Glow_PlayBtn_Hover3; // 0x568(0x08)
	struct UImage* IMG_Glow_PlayBtn_Hover4; // 0x570(0x08)
	struct UImage* IMG_Glow_PlayBtn_Normal; // 0x578(0x08)
	struct UImage* IMG_Glow_PlayBtn_Normal2; // 0x580(0x08)
	struct UImage* IMG_Glow_PlayBtn_Normal3; // 0x588(0x08)
	struct UImage* IMG_Glow_PlayBtn_Normal4; // 0x590(0x08)
	struct UImage* IMG_Marching_Bg; // 0x598(0x08)
	struct UImage* IMG_QR; // 0x5a0(0x08)
	struct URetainerBox* RB_Matching_Mask; // 0x5a8(0x08)
	struct URetainerBox* RB_PlayBtn_Mask; // 0x5b0(0x08)

	void PreConstruct(bool IsDesignTime); // Function AgentLobby.AgentLobby_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1b61b60
	void ExecuteUbergraph_AgentLobby(int32_t EntryPoint); // Function AgentLobby.AgentLobby_C.ExecuteUbergraph_AgentLobby // (Final|UbergraphFunction) // @ game+0x1b61b60
};

