// BlueprintGeneratedClass BP_Ai_Forklift_Auto_40sec.BP_Ai_Forklift_Auto_40sec_C
// Size: 0x7a8 (Inherited: 0x6c0)
struct ABP_Ai_Forklift_Auto_40sec_C : APDDynamicObject {
	struct UStaticMeshComponent* MDESTROY_Front; // 0x6c0(0x08)
	struct UStaticMeshComponent* MDESTROY_Back; // 0x6c8(0x08)
	struct UStaticMeshComponent* ALIVEOBJ_Front; // 0x6d0(0x08)
	struct UStaticMeshComponent* ALIVEOBJ_Back; // 0x6d8(0x08)
	struct UStaticMeshComponent* BAGGAGE#BOX_M; // 0x6e0(0x08)
	struct UStaticMeshComponent* BAGGAGE#BOX_F; // 0x6e8(0x08)
	struct UStaticMeshComponent* BAGGAGE#BOX; // 0x6f0(0x08)
	struct UStaticMeshComponent* WHEEL#TireFL2; // 0x6f8(0x08)
	struct UStaticMeshComponent* WHEEL#TireRR2; // 0x700(0x08)
	struct UStaticMeshComponent* WHEEL#TireRL2; // 0x708(0x08)
	struct UStaticMeshComponent* WHEEL#TireFR2; // 0x710(0x08)
	struct UStaticMeshComponent* WHEEL#TireFL1; // 0x718(0x08)
	struct UStaticMeshComponent* WHEEL#TireRR1; // 0x720(0x08)
	struct UStaticMeshComponent* WHEEL#TireRL1; // 0x728(0x08)
	struct UStaticMeshComponent* WHEEL#TireFR1; // 0x730(0x08)
	struct UStaticMeshComponent* WHEEL#TireRR; // 0x738(0x08)
	struct UStaticMeshComponent* WHEEL#TireRL; // 0x740(0x08)
	struct UStaticMeshComponent* WHEEL#TireFR; // 0x748(0x08)
	struct UStaticMeshComponent* WHEEL#TireFL; // 0x750(0x08)
	struct UStaticMeshComponent* SM_Ai_Forklift_Destroyed_Mid; // 0x758(0x08)
	struct USceneComponent* MDESTROY#; // 0x760(0x08)
	struct UPDDynamicObjectPoint* POINT2#Fire; // 0x768(0x08)
	struct UPDDynamicObjectPoint* POINT1#Smoke; // 0x770(0x08)
	struct USplineComponent* SPLINE1#Spline; // 0x778(0x08)
	struct UPDDynamicObjectPoint* POINT3#Explosion; // 0x780(0x08)
	struct UStaticMeshComponent* BODY#SM_Ai_Forklift_Destroyed; // 0x788(0x08)
	struct USceneComponent* FDESTROY#; // 0x790(0x08)
	struct UStaticMeshComponent* BODY#SM_Ai_Forklift; // 0x798(0x08)
	struct USceneComponent* ALIVEOBJ#; // 0x7a0(0x08)
};

