// BlueprintGeneratedClass BP_Ambulance.BP_Ambulance_C
// Size: 0x830 (Inherited: 0x6c0)
struct ABP_Ambulance_C : APDDynamicObject {
	struct UStaticMeshComponent* WINDOW5#SM_Ambulance_Window_HeadLight_R_Break; // 0x6c0(0x08)
	struct UStaticMeshComponent* WINDOW4#SM_Ambulance_Window_HeadLight_L_Break; // 0x6c8(0x08)
	struct UStaticMeshComponent* WINDOW3#SM_Ambulance_Window_FR_Break; // 0x6d0(0x08)
	struct UStaticMeshComponent* WINDOW2#SM_Ambulance_Window_FL_Break; // 0x6d8(0x08)
	struct UStaticMeshComponent* WINDOW1#SM_Ambulance_Window_FW_Break; // 0x6e0(0x08)
	struct USceneComponent* MDESTROY#; // 0x6e8(0x08)
	struct UStaticMeshComponent* WHEEL4#SM_Ambulance_Tire_RR_Break; // 0x6f0(0x08)
	struct UStaticMeshComponent* WHEEL3#SM_Ambulance_Tire_RL_Break; // 0x6f8(0x08)
	struct UStaticMeshComponent* WHEEL2#SM_Ambulance_Tire_FR_Break; // 0x700(0x08)
	struct UStaticMeshComponent* WHEEL1#SM_Ambulance_Tire_FL_Break; // 0x708(0x08)
	struct UStaticMeshComponent* BONNET#SM_Ambulance_Bonnet_Break; // 0x710(0x08)
	struct UStaticMeshComponent* RDOOR1#SM_Ambulance_Door_FR_Break; // 0x718(0x08)
	struct UStaticMeshComponent* LDOOR2#SM_Ambulance_Door_RL_Break; // 0x720(0x08)
	struct UStaticMeshComponent* LDOOR1#SM_Ambulance_Door_FL_Break; // 0x728(0x08)
	struct UStaticMeshComponent* RDOOR2#SM_Ambulance_Door_RR_Break; // 0x730(0x08)
	struct UStaticMeshComponent* BODY#SM_Ambulance_Base_Break; // 0x738(0x08)
	struct UPDDynamicObjectPoint* POINT3#Fire2_2; // 0x740(0x08)
	struct UPDDynamicObjectPoint* POINT2#Fire1_2; // 0x748(0x08)
	struct UPDDynamicObjectPoint* POINT1#Smoke1_2; // 0x750(0x08)
	struct UStaticMeshComponent* WHEEL4#SM_Ambulance_Tire_RR_Destroy; // 0x758(0x08)
	struct UStaticMeshComponent* WHEEL3#SM_Ambulance_Tire_RL_Destroy; // 0x760(0x08)
	struct UStaticMeshComponent* WHEEL2#SM_Ambulance_Tire_FR_Destroy; // 0x768(0x08)
	struct UStaticMeshComponent* WHEEL1#SM_Ambulance_Tire_FL_Destroy; // 0x770(0x08)
	struct UStaticMeshComponent* WHEEL4#SM_Ambulance_Tire_RR; // 0x778(0x08)
	struct UStaticMeshComponent* WHEEL3#SM_Ambulance_Tire_RL; // 0x780(0x08)
	struct UStaticMeshComponent* BODY#SM_Ambulance_Base_Destroy; // 0x788(0x08)
	struct USceneComponent* FDESTROY#; // 0x790(0x08)
	struct UStaticMeshComponent* WHEEL2#SM_Ambulance_Tire_FR; // 0x798(0x08)
	struct UStaticMeshComponent* WHEEL1#SM_Ambulance_Tire_FL; // 0x7a0(0x08)
	struct UStaticMeshComponent* BODY#SM_Ambulance_Base; // 0x7a8(0x08)
	struct USceneComponent* ALIVEOBJ#; // 0x7b0(0x08)
	struct UStaticMeshComponent* BONNET#SM_Ambulance_Bonnet_Destroy; // 0x7b8(0x08)
	struct UStaticMeshComponent* BONNET#SM_Ambulance_Bonnet; // 0x7c0(0x08)
	struct UStaticMeshComponent* RDOOR1#SM_Ambulance_Door_FR_Destroy; // 0x7c8(0x08)
	struct UStaticMeshComponent* LDOOR1#SM_Ambulance_Door_FL_Destroy; // 0x7d0(0x08)
	struct UStaticMeshComponent* RDOOR2#SM_Ambulance_Door_RR_Destroy; // 0x7d8(0x08)
	struct UStaticMeshComponent* LDOOR2#SM_Ambulance_Door_RL_Destroy; // 0x7e0(0x08)
	struct UStaticMeshComponent* WINDOW5#SM_Ambulance_Window_HeadLight_R; // 0x7e8(0x08)
	struct UStaticMeshComponent* WINDOW4#SM_Ambulance_Window_HeadLight_L; // 0x7f0(0x08)
	struct UStaticMeshComponent* WINDOW3#SM_Ambulance_Window_FR; // 0x7f8(0x08)
	struct UStaticMeshComponent* WINDOW2#SM_Ambulance_Window_FL; // 0x800(0x08)
	struct UStaticMeshComponent* WINDOW1#SM_Ambulance_Window_FW; // 0x808(0x08)
	struct UStaticMeshComponent* RDOOR2#SM_Ambulance_Door_RR; // 0x810(0x08)
	struct UStaticMeshComponent* LDOOR2#SM_Ambulance_Door_RL; // 0x818(0x08)
	struct UStaticMeshComponent* RDOOR1#SM_Ambulance_Door_FR; // 0x820(0x08)
	struct UStaticMeshComponent* LDOOR1#SM_Ambulance_Door_FL; // 0x828(0x08)
};

