// BlueprintGeneratedClass BP_AGVTrailer_20FT_Container_002.BP_AGVTrailer_20FT_Container_002_C
// Size: 0x7e0 (Inherited: 0x6c0)
struct ABP_AGVTrailer_20FT_Container_002_C : APDDynamicObject {
	struct UStaticMeshComponent* MDESTROY_Back; // 0x6c0(0x08)
	struct UStaticMeshComponent* MDESTROY_Front; // 0x6c8(0x08)
	struct UStaticMeshComponent* ALIVEOBJ_Back; // 0x6d0(0x08)
	struct UStaticMeshComponent* ALIVEOBJ_Front; // 0x6d8(0x08)
	struct UStaticMeshComponent* WINDOW4#AGV_Trailer_glass7; // 0x6e0(0x08)
	struct UStaticMeshComponent* WINDOW3#AGV_Trailer_glass6; // 0x6e8(0x08)
	struct UStaticMeshComponent* WINDOW2#AGV_Trailer_glass4; // 0x6f0(0x08)
	struct UStaticMeshComponent* WINDOW1#AGV_Trailer_glass5; // 0x6f8(0x08)
	struct UStaticMeshComponent* WINDOW4#AGV_Trailer_glass3; // 0x700(0x08)
	struct UStaticMeshComponent* WINDOW3#AGV_Trailer_glass2; // 0x708(0x08)
	struct UStaticMeshComponent* WINDOW2#AGV_Trailer_glass1; // 0x710(0x08)
	struct UStaticMeshComponent* WINDOW1#AGV_Trailer_glass; // 0x718(0x08)
	struct UStaticMeshComponent* BAGGAGE#SM_AGV_20FTContainer_MD; // 0x720(0x08)
	struct UStaticMeshComponent* BAGGAGE#SM_AGV_20FTContainer; // 0x728(0x08)
	struct UStaticMeshComponent* BODY#SM_AGVTrailer_20FT_Burn_MD; // 0x730(0x08)
	struct UStaticMeshComponent* BODY#SM_AGV_Trailer_20FTContainer_FD; // 0x738(0x08)
	struct UStaticMeshComponent* BODY#SM_AGV_Trailer_20FTContainer; // 0x740(0x08)
	struct UPDDynamicObjectPoint* POINT2#Fire2_3; // 0x748(0x08)
	struct USplineComponent* SPLINE1#Spline; // 0x750(0x08)
	struct UStaticMeshComponent* WHEEL2#SM_AGVTrailer_Tire2; // 0x758(0x08)
	struct UStaticMeshComponent* WHEEL4#SM_AGVTrailer_Tire2; // 0x760(0x08)
	struct UStaticMeshComponent* WHEEL1#SM_AGVTrailer_Tire2; // 0x768(0x08)
	struct UStaticMeshComponent* WHEEL3#SM_AGVTrailer_Tire2; // 0x770(0x08)
	struct UStaticMeshComponent* WHEEL4#SM_AGVTrailer_Tire1; // 0x778(0x08)
	struct UStaticMeshComponent* WHEEL3#SM_AGVTrailer_Tire1; // 0x780(0x08)
	struct UStaticMeshComponent* WHEEL2#SM_AGVTrailer_Tire1; // 0x788(0x08)
	struct UStaticMeshComponent* WHEEL1#SM_AGVTrailer_Tire1; // 0x790(0x08)
	struct UStaticMeshComponent* WHEEL1#SM_AGVTrailer_Tire; // 0x798(0x08)
	struct UStaticMeshComponent* WHEEL4#SM_AGVTrailer_Tire; // 0x7a0(0x08)
	struct UStaticMeshComponent* WHEEL3#SM_AGVTrailer_Tire; // 0x7a8(0x08)
	struct UStaticMeshComponent* WHEEL2#SM_AGVTrailer_Tire; // 0x7b0(0x08)
	struct USceneComponent* MDESTROY#; // 0x7b8(0x08)
	struct UPDDynamicObjectPoint* POINT2#Fire1_2; // 0x7c0(0x08)
	struct UPDDynamicObjectPoint* POINT1#Smoke1_2; // 0x7c8(0x08)
	struct USceneComponent* FDESTROY#; // 0x7d0(0x08)
	struct USceneComponent* ALIVEOBJ#; // 0x7d8(0x08)
};

