// BlueprintGeneratedClass BP_AGVTrailer.BP_AGVTrailer_C
// Size: 0x278 (Inherited: 0x220)
struct ABP_AGVTrailer_C : AActor {
	struct UStaticMeshComponent* SM_AGVTrailer; // 0x220(0x08)
	struct UBoxComponent* Parkour_Volume01; // 0x228(0x08)
	struct UStaticMeshComponent* SM_AGVTrailer_Tire; // 0x230(0x08)
	struct UStaticMeshComponent* SM_AGVTrailer_Tire3; // 0x238(0x08)
	struct UStaticMeshComponent* SM_AGVTrailer_Tire1; // 0x240(0x08)
	struct UStaticMeshComponent* SM_AGVTrailer_Tire2; // 0x248(0x08)
	struct UStaticMeshComponent* AGV_Trailer_glass1; // 0x250(0x08)
	struct UStaticMeshComponent* AGV_Trailer_glass3; // 0x258(0x08)
	struct UStaticMeshComponent* AGV_Trailer_glass2; // 0x260(0x08)
	struct UStaticMeshComponent* AGV_Trailer_glass; // 0x268(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x270(0x08)
};

