// BlueprintGeneratedClass BP_Ai_BigForklift_002_Auto_Exp.BP_Ai_BigForklift_002_Auto_Exp_C
// Size: 0x7d8 (Inherited: 0x6c0)
struct ABP_Ai_BigForklift_002_Auto_Exp_C : APDDynamicObject {
	struct UStaticMeshComponent* MDESTROY_Back; // 0x6c0(0x08)
	struct UStaticMeshComponent* MDESTROY_Front; // 0x6c8(0x08)
	struct UStaticMeshComponent* ALIVEOBJ_Back; // 0x6d0(0x08)
	struct UStaticMeshComponent* ALIVEOBJ_Front; // 0x6d8(0x08)
	struct UStaticMeshComponent* WHEEL1#SM_AiBigForkliftWheel_003; // 0x6e0(0x08)
	struct UStaticMeshComponent* WHEEL2#SM_AiBigForkliftWheel_006; // 0x6e8(0x08)
	struct UStaticMeshComponent* WHEEL3#SM_AiBigForkliftWheel_004; // 0x6f0(0x08)
	struct UStaticMeshComponent* WHEEL4#SM_AiBigForkliftWheel_005; // 0x6f8(0x08)
	struct UStaticMeshComponent* WHEEL1#SM_AiBigForkliftWheel_002; // 0x700(0x08)
	struct UStaticMeshComponent* WHEEL4#SM_AiBigForkliftWheel_004; // 0x708(0x08)
	struct UStaticMeshComponent* WHEEL3#SM_AiBigForkliftWheel_003; // 0x710(0x08)
	struct UStaticMeshComponent* WHEEL2#SM_AiBigForkliftWheel_005; // 0x718(0x08)
	struct UStaticMeshComponent* WHEEL4#SM_AiBigForkliftWheel_003; // 0x720(0x08)
	struct UStaticMeshComponent* WHEEL2#SM_AiBigForkliftWheel_004; // 0x728(0x08)
	struct UStaticMeshComponent* BAGGAGE1#SM_AiBigForklift_004; // 0x730(0x08)
	struct UPDDynamicObjectPoint* POINT1#Smoke1_4; // 0x738(0x08)
	struct UPDDynamicObjectPoint* POINT1#Smoke1_3; // 0x740(0x08)
	struct UPDDynamicObjectPoint* POINT2#Fire2_4; // 0x748(0x08)
	struct UPDDynamicObjectPoint* POINT2#Fire2_3; // 0x750(0x08)
	struct UPDDynamicObjectPoint* POINT2#Fire2_2; // 0x758(0x08)
	struct UPDDynamicObjectPoint* POINT1#Smoke1_2; // 0x760(0x08)
	struct UStaticMeshComponent* BAGGAGE2#SM_AiBigForkliftBeam_003; // 0x768(0x08)
	struct UStaticMeshComponent* BODY#SM_AiBigForklift_003; // 0x770(0x08)
	struct USceneComponent* FDESTROY#1; // 0x778(0x08)
	struct UStaticMeshComponent* BAGGAGE2#SM_AiBigForkliftBeam_002; // 0x780(0x08)
	struct UStaticMeshComponent* BAGGAGE1#SM_AiBigForklift_003; // 0x788(0x08)
	struct UStaticMeshComponent* BODY#SM_AiBigForklift_002; // 0x790(0x08)
	struct UStaticMeshComponent* WHEEL1#SM_AiBigForkliftWheel_001; // 0x798(0x08)
	struct UStaticMeshComponent* WHEEL3#SM_AiBigForkliftWheel_002; // 0x7a0(0x08)
	struct UStaticMeshComponent* BAGGAGE2#SM_AiBigForkliftBeam_001; // 0x7a8(0x08)
	struct UStaticMeshComponent* BAGGAGE1#SM_AiBigForklift_002; // 0x7b0(0x08)
	struct USceneComponent* MDESTROY#; // 0x7b8(0x08)
	struct UStaticMeshComponent* BODY#SM_AiBigForklift_001; // 0x7c0(0x08)
	struct USplineComponent* SPLINE1#Spline; // 0x7c8(0x08)
	struct USceneComponent* ALIVEOBJ#; // 0x7d0(0x08)
};

