// BlueprintGeneratedClass BP_AgentSUV_001_01.BP_AgentSUV_001_01_C
// Size: 0x280 (Inherited: 0x220)
struct ABP_AgentSUV_001_01_C : AActor {
	struct UChildActorComponent* BP_AgentSUV_Glass_Headlight_004; // 0x220(0x08)
	struct UChildActorComponent* BP_AgentSUV_Glass_Headlight_001; // 0x228(0x08)
	struct UChildActorComponent* BP_AgentSUV_Glass_Back_004; // 0x230(0x08)
	struct UChildActorComponent* BP_AgentSUV_Glass_Back_003; // 0x238(0x08)
	struct UChildActorComponent* BP_AgentSUV_Glass_Back_002; // 0x240(0x08)
	struct UChildActorComponent* BP_AgentSUV_Glass_Back_001; // 0x248(0x08)
	struct UBoxComponent* Parkour_Vol_003; // 0x250(0x08)
	struct UBoxComponent* Parkour_Vol_002; // 0x258(0x08)
	struct UStaticMeshComponent* SM_AgentSUV_001_03; // 0x260(0x08)
	struct UStaticMeshComponent* SM_AgentSUV_001_02; // 0x268(0x08)
	struct UStaticMeshComponent* SM_AgentSUV_001_01; // 0x270(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x278(0x08)
};

