// BlueprintGeneratedClass BP_Container_Ship_002.BP_Container_Ship_002_C
// Size: 0x2b0 (Inherited: 0x220)
struct ABP_Container_Ship_002_C : AActor {
	struct UStaticMeshComponent* SM_Container_Ship_002_10; // 0x220(0x08)
	struct UStaticMeshComponent* StaticMesh13; // 0x228(0x08)
	struct UStaticMeshComponent* StaticMesh12; // 0x230(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0x238(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x240(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Container_Ship_002_9; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Container_Ship_002_8; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Container_Ship_002_7; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Container_Ship_002_5; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Container_Ship_002_6; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Container_Ship_002_3; // 0x288(0x08)
	struct UStaticMeshComponent* 003; // 0x290(0x08)
	struct UStaticMeshComponent* 002; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Container_Ship_002_2; // 0x2a0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2a8(0x08)
};

