// BlueprintGeneratedClass BP_Container_40ft_002.BP_Container_40ft_002_C
// Size: 0x268 (Inherited: 0x220)
struct ABP_Container_40ft_002_C : AActor {
	struct UStaticMeshComponent* SM_Container_FakeMesh_003; // 0x220(0x08)
	struct UStaticMeshComponent* SM_Container_FakeMesh_002; // 0x228(0x08)
	struct UStaticMeshComponent* SM_Container_FakeMesh_001; // 0x230(0x08)
	struct UStaticMeshComponent* SM_NewDoor_L_002; // 0x238(0x08)
	struct UStaticMeshComponent* SM_NewDoor_R_002; // 0x240(0x08)
	struct UStaticMeshComponent* SM_NewDoor_L_001; // 0x248(0x08)
	struct UStaticMeshComponent* SM_NewDoor_R_001; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Container_10ft_001; // 0x258(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x260(0x08)
};

