// BlueprintGeneratedClass BP_Club_K_002.BP_Club_K_002_C
// Size: 0x280 (Inherited: 0x220)
struct ABP_Club_K_002_C : AActor {
	struct UStaticMeshComponent* SM_Club_K_002_010; // 0x220(0x08)
	struct UStaticMeshComponent* SM_Club_K_002_09; // 0x228(0x08)
	struct UStaticMeshComponent* SM_Club_K_001_04; // 0x230(0x08)
	struct UStaticMeshComponent* SM_Club_K_002_05; // 0x238(0x08)
	struct UStaticMeshComponent* SM_Club_K_002_08; // 0x240(0x08)
	struct UStaticMeshComponent* SM_Club_K_002_07; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Club_K_002_06; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Door_R_002; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Door_L_002; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Club_K_002_01_StaticMeshComponent0; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Club_K_002_02_StaticMeshComponent0; // 0x270(0x08)
	struct USceneComponent* SharedRoot; // 0x278(0x08)
};

