// BlueprintGeneratedClass BP_Dock_001_02.BP_Dock_001_02_C
// Size: 0x2b8 (Inherited: 0x220)
struct ABP_Dock_001_02_C : AActor {
	struct UStaticMeshComponent* SM_SignC_03; // 0x220(0x08)
	struct UStaticMeshComponent* Cube; // 0x228(0x08)
	struct UStaticMeshComponent* Cube1; // 0x230(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_033; // 0x238(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_037; // 0x240(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_038; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_034; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_035; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Dock_DA_05; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Dock_DA_06; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_036; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Dock_02_05; // 0x278(0x08)
	struct UStaticMeshComponent* SM_MERGED_DockPipe_016; // 0x280(0x08)
	struct UStaticMeshComponent* SM_MERGED_DockPipe_015; // 0x288(0x08)
	struct UStaticMeshComponent* SM_MERGED_DockPipe_013; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Dock_03_04_01; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Dock_02_06; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Dock_03_001; // 0x2a8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2b0(0x08)
};

