// BlueprintGeneratedClass BP_DeliveryTruck_B.BP_DeliveryTruck_B_C
// Size: 0x840 (Inherited: 0x6c0)
struct ABP_DeliveryTruck_B_C : APDDynamicObject {
	struct UStaticMeshComponent* WHEEL1#SM_Van_Tire_001_FL_Mid; // 0x6c0(0x08)
	struct UStaticMeshComponent* WHEEL6#SM_Van_Tire_001_RR_Mid; // 0x6c8(0x08)
	struct UStaticMeshComponent* WHEEL5#SM_Van_Tire_001_RL_Mid; // 0x6d0(0x08)
	struct UStaticMeshComponent* WHEEL4#SM_Van_Tire_001_RR_Mid; // 0x6d8(0x08)
	struct UStaticMeshComponent* WHEEL3#SM_Van_Tire_001_RL_Mid; // 0x6e0(0x08)
	struct UStaticMeshComponent* WHEEL2#SM_Van_Tire_001_FR_Mid; // 0x6e8(0x08)
	struct UStaticMeshComponent* LDOOR2#SM_DeliveryTruck_Door_RL_Mid; // 0x6f0(0x08)
	struct UStaticMeshComponent* BONNET#DeliveryTruck_Head_Bonnet_Mid; // 0x6f8(0x08)
	struct UStaticMeshComponent* WINDOW5#DeliveryTruck_Window_HeadLights_Mid; // 0x700(0x08)
	struct UStaticMeshComponent* WINDOW4#DeliveryTruck_Window_HeadLights_Mid; // 0x708(0x08)
	struct UStaticMeshComponent* WINDOW3#DeliveryTruck_Window_Side_Mid; // 0x710(0x08)
	struct UStaticMeshComponent* WINDOW2#DeliveryTruck_Window_Side_Mid; // 0x718(0x08)
	struct UStaticMeshComponent* WINDOW1#DeliveryTruck_Window_01_Mid; // 0x720(0x08)
	struct UStaticMeshComponent* RDOOR2#SM_DeliveryTruck_Door_RR_Mid; // 0x728(0x08)
	struct UStaticMeshComponent* BODY#SM_DeliveryTruck_Head_BASE_Mid; // 0x730(0x08)
	struct USceneComponent* MDESTROY#; // 0x738(0x08)
	struct UStaticMeshComponent* WHEEL5#SM_Van_Tire_001_RL1_Destroy; // 0x740(0x08)
	struct UStaticMeshComponent* WHEEL6#SM_Van_Tire_001_RR1_Destroy; // 0x748(0x08)
	struct UStaticMeshComponent* WHEEL6#SM_Van_Tire_001_RR1; // 0x750(0x08)
	struct UStaticMeshComponent* WHEEL5#SM_Van_Tire_001_RL1; // 0x758(0x08)
	struct UPDDynamicObjectPoint* POINT3#Fire2_2; // 0x760(0x08)
	struct UPDDynamicObjectPoint* POINT2#Fire1_2; // 0x768(0x08)
	struct UPDDynamicObjectPoint* POINT1#Smoke1_2; // 0x770(0x08)
	struct UStaticMeshComponent* WHEEL4#SM_Van_Tire_001_RR_Destroy; // 0x778(0x08)
	struct UStaticMeshComponent* WHEEL3#SM_Van_Tire_001_RL_Destroy; // 0x780(0x08)
	struct UStaticMeshComponent* WHEEL2#SM_Van_Tire_001_FR_Destroy; // 0x788(0x08)
	struct UStaticMeshComponent* WHEEL1#SM_Van_Tire_001_FL_Destroy; // 0x790(0x08)
	struct UStaticMeshComponent* WHEEL4#SM_Van_Tire_001_RR; // 0x798(0x08)
	struct UStaticMeshComponent* WHEEL3#SM_Van_Tire_001_RL; // 0x7a0(0x08)
	struct UStaticMeshComponent* BODY#SM_DeliveryTruck_Head_BASE_Destroy; // 0x7a8(0x08)
	struct USceneComponent* FDESTROY#; // 0x7b0(0x08)
	struct UStaticMeshComponent* WHEEL2#SM_Van_Tire_001_FR; // 0x7b8(0x08)
	struct UStaticMeshComponent* WHEEL1#SM_Van_Tire_001_FL; // 0x7c0(0x08)
	struct UStaticMeshComponent* BODY#SM_DeliveryTruck_Head_BASE; // 0x7c8(0x08)
	struct USceneComponent* ALIVEOBJ#; // 0x7d0(0x08)
	struct UStaticMeshComponent* BONNET#DeliveryTruck_Head_Bonnet_Destroy; // 0x7d8(0x08)
	struct UStaticMeshComponent* BONNET#DeliveryTruck_Head_Bonnet; // 0x7e0(0x08)
	struct UStaticMeshComponent* RDOOR1#Delivery_Truck_Door_Destroy; // 0x7e8(0x08)
	struct UStaticMeshComponent* LDOOR1#Delivery_Truck_Door_Destroy_02; // 0x7f0(0x08)
	struct UStaticMeshComponent* RDOOR2#SM_DeliveryTruck_Door_RR_Destroy; // 0x7f8(0x08)
	struct UStaticMeshComponent* LDOOR2#SM_DeliveryTruck_Door_RL_Destroy; // 0x800(0x08)
	struct UStaticMeshComponent* WINDOW5#DeliveryTruck_Window_HeadLights; // 0x808(0x08)
	struct UStaticMeshComponent* WINDOW4#DeliveryTruck_Window_HeadLights; // 0x810(0x08)
	struct UStaticMeshComponent* WINDOW3#DeliveryTruck_Window_Side; // 0x818(0x08)
	struct UStaticMeshComponent* WINDOW2#DeliveryTruck_Window_Side; // 0x820(0x08)
	struct UStaticMeshComponent* WINDOW1#DeliveryTruck_Window_01; // 0x828(0x08)
	struct UStaticMeshComponent* RDOOR2#SM_DeliveryTruck_Door_RR; // 0x830(0x08)
	struct UStaticMeshComponent* LDOOR2#SM_DeliveryTruck_Door_RL; // 0x838(0x08)
};

