// BlueprintGeneratedClass BP_Dock_001_01.BP_Dock_001_01_C
// Size: 0x610 (Inherited: 0x220)
struct ABP_Dock_001_01_C : AActor {
	struct UStaticMeshComponent* SM_MERGED_DockPipe_017; // 0x220(0x08)
	struct UStaticMeshComponent* SM_MERGED_DockPipe_016; // 0x228(0x08)
	struct UStaticMeshComponent* SM_MERGED_DockPipe_015; // 0x230(0x08)
	struct UStaticMeshComponent* Cube15; // 0x238(0x08)
	struct UStaticMeshComponent* Cube14; // 0x240(0x08)
	struct UStaticMeshComponent* Cube13; // 0x248(0x08)
	struct UStaticMeshComponent* Cube12; // 0x250(0x08)
	struct UStaticMeshComponent* Cube11; // 0x258(0x08)
	struct UStaticMeshComponent* Cube10; // 0x260(0x08)
	struct UStaticMeshComponent* Cube9; // 0x268(0x08)
	struct UStaticMeshComponent* Cube8; // 0x270(0x08)
	struct UStaticMeshComponent* Cube7; // 0x278(0x08)
	struct UStaticMeshComponent* Cube6; // 0x280(0x08)
	struct UStaticMeshComponent* Cube5; // 0x288(0x08)
	struct UStaticMeshComponent* Cube4; // 0x290(0x08)
	struct UStaticMeshComponent* Cube3; // 0x298(0x08)
	struct UStaticMeshComponent* Cube2; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_086; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_085; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_084; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_083; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Dock_DA_012; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Dock_DA_011; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_082; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_081; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_097; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_098; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_080; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_079; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_025; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_078; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_074; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_061; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_055; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_050; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_012; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_05; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Dock_02_09; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_077; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_032; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_096; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_095; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_094; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_093; // 0x378(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_092; // 0x380(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_068; // 0x388(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_039; // 0x390(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_091; // 0x398(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_075; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_076; // 0x3a8(0x08)
	struct USceneComponent* Fakemesh_L; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_073; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_072; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_071; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_070; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_069; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_067; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_066; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_065; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_064; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_063; // 0x400(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_062; // 0x408(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_060; // 0x410(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_059; // 0x418(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_058; // 0x420(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_057; // 0x428(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_056; // 0x430(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_054; // 0x438(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_053; // 0x440(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_052; // 0x448(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_051; // 0x450(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_049; // 0x458(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_048; // 0x460(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_047; // 0x468(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_046; // 0x470(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_045; // 0x478(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_044; // 0x480(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_043; // 0x488(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_042; // 0x490(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_041; // 0x498(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_040; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_Dock_DA_010; // 0x4a8(0x08)
	struct UStaticMeshComponent* SM_Dock_DA_09; // 0x4b0(0x08)
	struct UStaticMeshComponent* SM_Dock_DA_08; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_Dock_DA_07; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_Dock_DA_06; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_022; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_021; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_036; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_035; // 0x4e8(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_031; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_030; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_029; // 0x500(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_028; // 0x508(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_027; // 0x510(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_026; // 0x518(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_010; // 0x520(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_023; // 0x528(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_020; // 0x530(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_019; // 0x538(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_018; // 0x540(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_016; // 0x548(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_015; // 0x550(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_014; // 0x558(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_013; // 0x560(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_011; // 0x568(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_024; // 0x570(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_09; // 0x578(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_08; // 0x580(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_07; // 0x588(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_06; // 0x590(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_04; // 0x598(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_03; // 0x5a0(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_02; // 0x5a8(0x08)
	struct UStaticMeshComponent* SM_Dock_DA_05; // 0x5b0(0x08)
	struct UStaticMeshComponent* SM_Dock_DA_04; // 0x5b8(0x08)
	struct UStaticMeshComponent* SM_Dock_DA_03; // 0x5c0(0x08)
	struct UStaticMeshComponent* SM_Dock_DA_02; // 0x5c8(0x08)
	struct UStaticMeshComponent* SM_Dock_DA_01; // 0x5d0(0x08)
	struct UStaticMeshComponent* SM_Dock_FM_017; // 0x5d8(0x08)
	struct USceneComponent* Fakemesh_R; // 0x5e0(0x08)
	struct UStaticMeshComponent* SM_Dock_02_05; // 0x5e8(0x08)
	struct UStaticMeshComponent* SM_Dock_02_04; // 0x5f0(0x08)
	struct UStaticMeshComponent* SM_Dock_02_01; // 0x5f8(0x08)
	struct UStaticMeshComponent* SM_Dock_02_03; // 0x600(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x608(0x08)
};

