// BlueprintGeneratedClass BP_GoliathCrane_001.BP_GoliathCrane_001_C
// Size: 0x340 (Inherited: 0x220)
struct ABP_GoliathCrane_001_C : AActor {
	struct UStaticMeshComponent* SM_FakeMesh_002_5; // 0x220(0x08)
	struct UStaticMeshComponent* SM_FakeMesh_002_4; // 0x228(0x08)
	struct UStaticMeshComponent* SM_FakeMesh_002_3; // 0x230(0x08)
	struct UStaticMeshComponent* SM_FakeMesh_009; // 0x238(0x08)
	struct UStaticMeshComponent* SM_FakeMesh_003; // 0x240(0x08)
	struct UStaticMeshComponent* SM_FakeMesh_005; // 0x248(0x08)
	struct UStaticMeshComponent* SM_FakeMesh_002; // 0x250(0x08)
	struct UStaticMeshComponent* SM_FakeMesh_006; // 0x258(0x08)
	struct UStaticMeshComponent* SM_FakeMesh_004; // 0x260(0x08)
	struct UStaticMeshComponent* SM_FakeMesh_001; // 0x268(0x08)
	struct UStaticMeshComponent* SM_FakeMesh_008; // 0x270(0x08)
	struct UStaticMeshComponent* SM_FakeMesh_0010; // 0x278(0x08)
	struct UStaticMeshComponent* SM_FakeMesh_002_2; // 0x280(0x08)
	struct UStaticMeshComponent* SM_FakeMesh_007; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Goliath_FakeMesh_006; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Goliath_FakeMesh_005; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Goliath_FakeMesh_004; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Goliath_FakeMesh_003; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Goliath_FakeMesh_002; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Goliath_FakeMesh_001; // 0x2b8(0x08)
	struct UBoxComponent* Parkour_Volume04; // 0x2c0(0x08)
	struct UBoxComponent* Parkour_Volume03; // 0x2c8(0x08)
	struct UBoxComponent* Parkour_Volume02; // 0x2d0(0x08)
	struct UBoxComponent* Parkour_Volume01; // 0x2d8(0x08)
	struct USceneComponent* DFMesh; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_STS_engine_001; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_LedLight_004; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_LedLight_003; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_LedLight_002; // 0x300(0x08)
	struct UStaticMeshComponent* SM_LedLight_001; // 0x308(0x08)
	struct UStaticMeshComponent* SM_STS_engine_004; // 0x310(0x08)
	struct UStaticMeshComponent* SM_STS_engine_003; // 0x318(0x08)
	struct UStaticMeshComponent* SM_STS_engine_002; // 0x320(0x08)
	struct UStaticMeshComponent* SM_GoliathCrane_45m_002; // 0x328(0x08)
	struct UStaticMeshComponent* SM_GoliathCrane_001; // 0x330(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x338(0x08)
};

