// BlueprintGeneratedClass BP_MERGED_FrontStair_002.BP_MERGED_FrontStair_002_C
// Size: 0x268 (Inherited: 0x220)
struct ABP_MERGED_FrontStair_002_C : AActor {
	struct UBoxComponent* Box6; // 0x220(0x08)
	struct UBoxComponent* Box5; // 0x228(0x08)
	struct UBoxComponent* Box4; // 0x230(0x08)
	struct UBoxComponent* Box3; // 0x238(0x08)
	struct UBoxComponent* Box2; // 0x240(0x08)
	struct UBoxComponent* Box1; // 0x248(0x08)
	struct UStaticMeshComponent* SM_MERGED_FrontStair_002; // 0x250(0x08)
	struct UBoxComponent* Box; // 0x258(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x260(0x08)
};

