// BlueprintGeneratedClass BP_MERGED_MiddleStair_002.BP_MERGED_MiddleStair_002_C
// Size: 0x270 (Inherited: 0x220)
struct ABP_MERGED_MiddleStair_002_C : AActor {
	struct UBoxComponent* Sub_Collision_01; // 0x220(0x08)
	struct UStaticMeshComponent* DF_MERGED_MiddleStair_002_01; // 0x228(0x08)
	struct UStaticMeshComponent* DF_MERGED_MiddleStair_002_04; // 0x230(0x08)
	struct UStaticMeshComponent* DF_MERGED_MiddleStair_002_05; // 0x238(0x08)
	struct UStaticMeshComponent* DF_MERGED_MiddleStair_002_06; // 0x240(0x08)
	struct UStaticMeshComponent* DF_MERGED_MiddleStair_002_07; // 0x248(0x08)
	struct UStaticMeshComponent* DF_MERGED_MiddleStair_002_03; // 0x250(0x08)
	struct UStaticMeshComponent* DF_MERGED_MiddleStair_002_02; // 0x258(0x08)
	struct UStaticMeshComponent* SM_MERGED_MiddleStair_002; // 0x260(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x268(0x08)
};

