// BlueprintGeneratedClass BP_Missile_WoodenBox_001_03_looby.BP_Missile_WoodenBox_001_03_looby_C
// Size: 0x260 (Inherited: 0x220)
struct ABP_Missile_WoodenBox_001_03_looby_C : AActor {
	struct UStaticMeshComponent* SM_Club_K_002_07; // 0x220(0x08)
	struct UStaticMeshComponent* SM_Missile_WoodenBox_001_05; // 0x228(0x08)
	struct UStaticMeshComponent* SM_Missile_WoodenBox_001_06; // 0x230(0x08)
	struct UStaticMeshComponent* SM_Missile_WoodenBox_001_04; // 0x238(0x08)
	struct UStaticMeshComponent* SM_Missile_WoodenBox_001_03; // 0x240(0x08)
	struct UStaticMeshComponent* SM_Missile_WoodenBox_001_02; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Missile_WoodenBox_001_01; // 0x250(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x258(0x08)
};

