// BlueprintGeneratedClass BP_MERGED_SmallWarehouse_001.BP_MERGED_SmallWarehouse_001_C
// Size: 0x3b0 (Inherited: 0x220)
struct ABP_MERGED_SmallWarehouse_001_C : AActor {
	struct UStaticMeshComponent* DF_SmallWare011_0010; // 0x220(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0011; // 0x228(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_006; // 0x230(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0022; // 0x238(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_009; // 0x240(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_008; // 0x248(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_007; // 0x250(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0043; // 0x258(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0042; // 0x260(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0041; // 0x268(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0040; // 0x270(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0039; // 0x278(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0038; // 0x280(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0033; // 0x288(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0037; // 0x290(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0036; // 0x298(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0035; // 0x2a0(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0034; // 0x2a8(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0031; // 0x2b0(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0032; // 0x2b8(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0030; // 0x2c0(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0029; // 0x2c8(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0028; // 0x2d0(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0026; // 0x2d8(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0025; // 0x2e0(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0023; // 0x2e8(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_001; // 0x2f0(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0017; // 0x2f8(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0020; // 0x300(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0019; // 0x308(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0018; // 0x310(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_002; // 0x318(0x08)
	struct UStaticMeshComponent* DF_SmallWare011_0024; // 0x320(0x08)
	struct UStaticMeshComponent* SM_SmallWarehouse_Wall_011; // 0x328(0x08)
	struct UStaticMeshComponent* SM_SmallWarehouse_Wall_015; // 0x330(0x08)
	struct UStaticMeshComponent* SM_WallWire_010; // 0x338(0x08)
	struct UStaticMeshComponent* SM_WallSwitch_02; // 0x340(0x08)
	struct UStaticMeshComponent* SM_LedLight_001_09; // 0x348(0x08)
	struct UStaticMeshComponent* SM_LedLight_001_07; // 0x350(0x08)
	struct UStaticMeshComponent* SM_RollShutter_001; // 0x358(0x08)
	struct UStaticMeshComponent* SM_RollShutter_003; // 0x360(0x08)
	struct UStaticMeshComponent* SM_RollShutter_002; // 0x368(0x08)
	struct UStaticMeshComponent* SM_WallWire_015; // 0x370(0x08)
	struct UStaticMeshComponent* SM_WallSwitch_07; // 0x378(0x08)
	struct UStaticMeshComponent* SM_SignC_03; // 0x380(0x08)
	struct UStaticMeshComponent* SM_SignC_01; // 0x388(0x08)
	struct UStaticMeshComponent* SM_SignC_02; // 0x390(0x08)
	struct UStaticMeshComponent* SM_LedLight_001_012; // 0x398(0x08)
	struct UStaticMeshComponent* SM_LedLight_001_011; // 0x3a0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x3a8(0x08)
};

