// BlueprintGeneratedClass BP_MERGED_ShipWareSub_001.BP_MERGED_ShipWareSub_001_C
// Size: 0x2a0 (Inherited: 0x220)
struct ABP_MERGED_ShipWareSub_001_C : AActor {
	struct UStaticMeshComponent* SM_LedLight_007; // 0x220(0x08)
	struct UStaticMeshComponent* SM_LedLight_006; // 0x228(0x08)
	struct UStaticMeshComponent* SM_LedLight_005; // 0x230(0x08)
	struct UStaticMeshComponent* SM_LedLight_004; // 0x238(0x08)
	struct UStaticMeshComponent* SM_LedLight_003; // 0x240(0x08)
	struct UStaticMeshComponent* SM_FuseBox_03; // 0x248(0x08)
	struct UStaticMeshComponent* SM_WallWire_03; // 0x250(0x08)
	struct UStaticMeshComponent* SM_FuseBox_02; // 0x258(0x08)
	struct UStaticMeshComponent* SM_WallWire_02; // 0x260(0x08)
	struct UStaticMeshComponent* SM_RollShutter_003; // 0x268(0x08)
	struct UStaticMeshComponent* SM_RollShutter_002; // 0x270(0x08)
	struct UStaticMeshComponent* SM_RollShutter_001; // 0x278(0x08)
	struct UStaticMeshComponent* SM_MERGED_ShipWareDeco_001; // 0x280(0x08)
	struct UStaticMeshComponent* SM_MERGED_ShipWareSubTop_001; // 0x288(0x08)
	struct UStaticMeshComponent* SM_MERGED_ShipWareSub_001; // 0x290(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x298(0x08)
};

