// BlueprintGeneratedClass BP_ShipBlock_Tale_001.BP_ShipBlock_Tale_001_C
// Size: 0x3c8 (Inherited: 0x220)
struct ABP_ShipBlock_Tale_001_C : AActor {
	struct UStaticMeshComponent* SM_Ship_C_FM_012; // 0x220(0x08)
	struct UStaticMeshComponent* SM_Ship_C_FM_011; // 0x228(0x08)
	struct UStaticMeshComponent* SM_Ship_C_FM_010; // 0x230(0x08)
	struct UStaticMeshComponent* SM_Ship_C_FM_09; // 0x238(0x08)
	struct UStaticMeshComponent* SM_Ship_C_FM_08; // 0x240(0x08)
	struct UStaticMeshComponent* SM_Ship_C_FM_07; // 0x248(0x08)
	struct UStaticMeshComponent* SM_CautionSign_004; // 0x250(0x08)
	struct UStaticMeshComponent* SM_CautionSign_003; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Decal_031; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Decal_029; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Decal_015; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Decal_030; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Decal_028; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Decal_014; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Decal_004; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Decal_013; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Decal_019; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Decal_020; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Ship_C_Block_Shape_04; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Ship_C_Block_Shape_03; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Ship_C_Block_Shape_01_StaticMeshComponent0; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_FloorWire_4_StaticMeshComponent0; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_FloorWire_004_StaticMeshComponent0; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Dock_5_StaticMeshComponent0; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Dock_12_StaticMeshComponent0; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Dock_3_StaticMeshComponent0; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Dock_9_StaticMeshComponent0; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Dock_4_StaticMeshComponent0; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Ship_C_Block_Shape_02_StaticMeshComponent0; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Dock_11_StaticMeshComponent0; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Dock_10_StaticMeshComponent0; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Dock_7_StaticMeshComponent0; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Dock_2_StaticMeshComponent0; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Dock_8_StaticMeshComponent0; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Dock_01_StaticMeshComponent0; // 0x330(0x08)
	struct UStaticMeshComponent* SM_CraneSign_5_StaticMeshComponent0; // 0x338(0x08)
	struct UStaticMeshComponent* SM_CraneSign_3_StaticMeshComponent0; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Dock_6_StaticMeshComponent0; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Ship_C_FM_06; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Ship_C_FM_05; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Ship_C_FM_04; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Ship_C_FM_03; // 0x368(0x08)
	struct USceneComponent* Scene1; // 0x370(0x08)
	struct UStaticMeshComponent* SM_WallLetter_T2001_StaticMeshComponent0; // 0x378(0x08)
	struct UStaticMeshComponent* SM_WallLetter_T2008_StaticMeshComponent0; // 0x380(0x08)
	struct UStaticMeshComponent* SM_WallLetter_T2003_StaticMeshComponent0; // 0x388(0x08)
	struct UStaticMeshComponent* SM_WallLetter_T2007_StaticMeshComponent0; // 0x390(0x08)
	struct UStaticMeshComponent* SM_WallLetter_T2001_StaticMeshComponent2; // 0x398(0x08)
	struct UStaticMeshComponent* SM_WallLetter_T2001_StaticMeshComponent1; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_WallLetter_T2003_StaticMeshComponent2; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_WallLetter_T2003_StaticMeshComponent1; // 0x3b0(0x08)
	struct USceneComponent* Scene; // 0x3b8(0x08)
	struct USceneComponent* SharedRoot; // 0x3c0(0x08)
};

