// BlueprintGeneratedClass BP_ShipBlock_Front_001.BP_ShipBlock_Front_001_C
// Size: 0x3e8 (Inherited: 0x220)
struct ABP_ShipBlock_Front_001_C : AActor {
	struct UStaticMeshComponent* SM_Ship_Block_Merged_Front_004; // 0x220(0x08)
	struct UStaticMeshComponent* SM_Ship_A_Block_Deco_02; // 0x228(0x08)
	struct UStaticMeshComponent* SM_Ship_A_Block_Shadow_02; // 0x230(0x08)
	struct UStaticMeshComponent* SM_Ship_A_Block_Rope_02; // 0x238(0x08)
	struct UStaticMeshComponent* SM_Ship_A_Block_Shape_04; // 0x240(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_009; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Ship_Block_Wall_Decal_06; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent218; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Ship_A_FM_02; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Ship_A_FM_01; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Ship_Merged_Block_Floor_001; // 0x278(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Sign_001; // 0x280(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Pipe_005; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Ship_Block_Wall_Decal_05; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Ship_Block_Wall_Decal_04; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_015; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_02_02; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_014; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_013; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_012; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_011; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_010; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_09; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_08; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_07; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_06; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_05; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_04; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_03; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_02_01; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_02; // 0x318(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_004; // 0x320(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_006; // 0x328(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_001; // 0x330(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_008; // 0x338(0x08)
	struct UStaticMeshComponent* StaticMeshComponent222; // 0x340(0x08)
	struct UStaticMeshComponent* StaticMeshComponent215; // 0x348(0x08)
	struct UStaticMeshComponent* StaticMeshComponent217; // 0x350(0x08)
	struct UStaticMeshComponent* StaticMeshComponent220; // 0x358(0x08)
	struct UStaticMeshComponent* StaticMeshComponent221; // 0x360(0x08)
	struct UStaticMeshComponent* StaticMeshComponent212; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Ship_A_Block_Anchor_01; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Ship_A_Block_Rope_01; // 0x378(0x08)
	struct UStaticMeshComponent* StaticMeshComponent219; // 0x380(0x08)
	struct USceneComponent* prop; // 0x388(0x08)
	struct UStaticMeshComponent* StaticMeshComponent289; // 0x390(0x08)
	struct USceneComponent* decal; // 0x398(0x08)
	struct USceneComponent* Shadow; // 0x3a0(0x08)
	struct UBoxComponent* Box4; // 0x3a8(0x08)
	struct UBoxComponent* Box3; // 0x3b0(0x08)
	struct UBoxComponent* Box2; // 0x3b8(0x08)
	struct UBoxComponent* Box1; // 0x3c0(0x08)
	struct UBoxComponent* Box; // 0x3c8(0x08)
	struct USceneComponent* Collision; // 0x3d0(0x08)
	struct USceneComponent* Base; // 0x3d8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x3e0(0x08)
};

