// BlueprintGeneratedClass BP_ShipBlock_Mid_001.BP_ShipBlock_Mid_001_C
// Size: 0x708 (Inherited: 0x220)
struct ABP_ShipBlock_Mid_001_C : AActor {
	struct UStaticMeshComponent* SM_MERGED_Ship_Pipe_004; // 0x220(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Pipe_003; // 0x228(0x08)
	struct UBoxComponent* Box3; // 0x230(0x08)
	struct UBoxComponent* Box2; // 0x238(0x08)
	struct UBoxComponent* Box1; // 0x240(0x08)
	struct UBoxComponent* Box; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent434; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent441; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Pipe_002; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Pipe_001; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_005_04; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_02_04; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_038; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_037; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_036; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_035; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_034; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_033; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_032; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_02_03; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_031; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_030; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_029; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_028; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_027; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_026; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_025; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_02_02; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_024; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_023; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_022; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_021; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_020; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_019; // 0x378(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_018; // 0x380(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_017; // 0x388(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_016; // 0x390(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_015; // 0x398(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_014; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_013; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_012; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_011; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_010; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_09; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_005_03; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_0010; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_005_02; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_005_01; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_007; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_0015; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_0014; // 0x400(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_0012; // 0x408(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_004_02; // 0x410(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_004_01; // 0x418(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_0011; // 0x420(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_009; // 0x428(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_008; // 0x430(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_006; // 0x438(0x08)
	struct UStaticMeshComponent* SM_Ship_Block_Front_05; // 0x440(0x08)
	struct UStaticMeshComponent* SM_Ship_Block_Front_04; // 0x448(0x08)
	struct UStaticMeshComponent* SM_Ship_Block_Front_03; // 0x450(0x08)
	struct UStaticMeshComponent* SM_Ship_Block_Front_02; // 0x458(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_02_01; // 0x460(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_08; // 0x468(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_07; // 0x470(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_06; // 0x478(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_05; // 0x480(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_04; // 0x488(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_03; // 0x490(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_02; // 0x498(0x08)
	struct UStaticMeshComponent* SM_Ship_B_FM_01; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_005; // 0x4a8(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_004; // 0x4b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent338; // 0x4b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent342; // 0x4c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent330; // 0x4c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent328; // 0x4d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent343; // 0x4d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent348; // 0x4e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent340; // 0x4e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent344; // 0x4f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent341; // 0x4f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent339; // 0x500(0x08)
	struct UStaticMeshComponent* StaticMeshComponent263; // 0x508(0x08)
	struct UStaticMeshComponent* StaticMeshComponent373; // 0x510(0x08)
	struct UStaticMeshComponent* StaticMeshComponent436; // 0x518(0x08)
	struct UStaticMeshComponent* StaticMeshComponent435; // 0x520(0x08)
	struct UStaticMeshComponent* StaticMeshComponent433; // 0x528(0x08)
	struct UStaticMeshComponent* StaticMeshComponent432; // 0x530(0x08)
	struct UStaticMeshComponent* StaticMeshComponent431; // 0x538(0x08)
	struct UStaticMeshComponent* StaticMeshComponent427; // 0x540(0x08)
	struct UStaticMeshComponent* StaticMeshComponent425; // 0x548(0x08)
	struct UStaticMeshComponent* StaticMeshComponent424; // 0x550(0x08)
	struct UStaticMeshComponent* StaticMeshComponent419; // 0x558(0x08)
	struct UStaticMeshComponent* StaticMeshComponent416; // 0x560(0x08)
	struct UStaticMeshComponent* StaticMeshComponent413; // 0x568(0x08)
	struct UStaticMeshComponent* StaticMeshComponent109; // 0x570(0x08)
	struct UStaticMeshComponent* StaticMeshComponent108; // 0x578(0x08)
	struct UStaticMeshComponent* StaticMeshComponent103; // 0x580(0x08)
	struct UStaticMeshComponent* StaticMeshComponent102; // 0x588(0x08)
	struct UStaticMeshComponent* StaticMeshComponent65; // 0x590(0x08)
	struct UStaticMeshComponent* StaticMeshComponent63; // 0x598(0x08)
	struct UStaticMeshComponent* StaticMeshComponent62; // 0x5a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent412; // 0x5a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent542; // 0x5b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent541; // 0x5b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent540; // 0x5c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent539; // 0x5c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent538; // 0x5d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent532; // 0x5d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent536; // 0x5e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent535; // 0x5e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent534; // 0x5f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent533; // 0x5f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent537; // 0x600(0x08)
	struct UStaticMeshComponent* StaticMeshComponent555; // 0x608(0x08)
	struct UStaticMeshComponent* StaticMeshComponent385; // 0x610(0x08)
	struct UStaticMeshComponent* StaticMeshComponent554; // 0x618(0x08)
	struct UStaticMeshComponent* StaticMeshComponent552; // 0x620(0x08)
	struct UStaticMeshComponent* StaticMeshComponent551; // 0x628(0x08)
	struct UStaticMeshComponent* StaticMeshComponent550; // 0x630(0x08)
	struct UStaticMeshComponent* StaticMeshComponent549; // 0x638(0x08)
	struct UStaticMeshComponent* StaticMeshComponent543; // 0x640(0x08)
	struct UStaticMeshComponent* StaticMeshComponent547; // 0x648(0x08)
	struct UStaticMeshComponent* StaticMeshComponent546; // 0x650(0x08)
	struct UStaticMeshComponent* StaticMeshComponent545; // 0x658(0x08)
	struct UStaticMeshComponent* StaticMeshComponent544; // 0x660(0x08)
	struct UStaticMeshComponent* StaticMeshComponent548; // 0x668(0x08)
	struct UStaticMeshComponent* StaticMeshComponent583; // 0x670(0x08)
	struct UStaticMeshComponent* StaticMeshComponent564; // 0x678(0x08)
	struct UStaticMeshComponent* StaticMeshComponent563; // 0x680(0x08)
	struct UStaticMeshComponent* StaticMeshComponent562; // 0x688(0x08)
	struct UStaticMeshComponent* StaticMeshComponent561; // 0x690(0x08)
	struct UStaticMeshComponent* StaticMeshComponent560; // 0x698(0x08)
	struct UStaticMeshComponent* StaticMeshComponent559; // 0x6a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent558; // 0x6a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent557; // 0x6b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent556; // 0x6b8(0x08)
	struct USceneComponent* Shadow; // 0x6c0(0x08)
	struct USceneComponent* decal; // 0x6c8(0x08)
	struct USceneComponent* prop; // 0x6d0(0x08)
	struct USceneComponent* SharedRoot; // 0x6d8(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_003; // 0x6e0(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_002; // 0x6e8(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Block_001; // 0x6f0(0x08)
	struct UStaticMeshComponent* SM_Ship_Block_Floor_04; // 0x6f8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x700(0x08)
};

