// BlueprintGeneratedClass BP_ShipBlock_Move_001.BP_ShipBlock_Move_001_C
// Size: 0x318 (Inherited: 0x220)
struct ABP_ShipBlock_Move_001_C : AActor {
	struct UStaticMeshComponent* StaticMesh11; // 0x220(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x228(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x230(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x238(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x240(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x258(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Pipe_003; // 0x260(0x08)
	struct UStaticMeshComponent* SM_MERGED_Ship_Pipe_002; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Ship_C_FM_03; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Ship_C_FM_02; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Ship_C_FM_01; // 0x280(0x08)
	struct USceneComponent* ShipBlock; // 0x288(0x08)
	struct USceneComponent* Scene; // 0x290(0x08)
	struct USceneComponent* Shadow; // 0x298(0x08)
	struct USceneComponent* Deco; // 0x2a0(0x08)
	struct USceneComponent* decal; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Pipe_001_9_StaticMeshComponent0; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Pipe_001_12_StaticMeshComponent0; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Pipe_001_11_StaticMeshComponent0; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Pipe_001_08_StaticMeshComponent0; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_WallLetter_T2004_StaticMeshComponent1; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_WallLetter_T2004_StaticMeshComponent0; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Ship_C_Block_Decal_01_StaticMeshComponent0; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Crane_Loader_03_StaticMeshComponent0; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_CraneSign_2_StaticMeshComponent0; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_WallWire_03_StaticMeshComponent0; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_WallWire_4_StaticMeshComponent0; // 0x300(0x08)
	struct UStaticMeshComponent* SM_CraneSign_4_StaticMeshComponent0; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Ship_C_Block_Move_01_StaticMeshComponent0; // 0x310(0x08)
};

