// BlueprintGeneratedClass BP_Transtainer.BP_Transtainer_C
// Size: 0x798 (Inherited: 0x6c0)
struct ABP_Transtainer_C : APDDynamicObject {
	struct UStaticMeshComponent* ALIVEOBJ_MID3; // 0x6c0(0x08)
	struct UStaticMeshComponent* ALIVEOBJ_MID2; // 0x6c8(0x08)
	struct UStaticMeshComponent* ALIVEOBJ_MID1; // 0x6d0(0x08)
	struct UStaticMeshComponent* ALIVEOBJ_MID; // 0x6d8(0x08)
	struct UStaticMeshComponent* ALIVEOBJ_Front2; // 0x6e0(0x08)
	struct UStaticMeshComponent* ALIVEOBJ_Back2; // 0x6e8(0x08)
	struct UStaticMeshComponent* ALIVEOBJ_Back3; // 0x6f0(0x08)
	struct UStaticMeshComponent* ALIVEOBJ_Front3; // 0x6f8(0x08)
	struct UStaticMeshComponent* ALIVEOBJ_Front1; // 0x700(0x08)
	struct UStaticMeshComponent* ALIVEOBJ_Back1; // 0x708(0x08)
	struct UStaticMeshComponent* ALIVEOBJ_Front; // 0x710(0x08)
	struct UStaticMeshComponent* ALIVEOBJ_Back; // 0x718(0x08)
	struct UStaticMeshComponent* PARTS1#Switch1; // 0x720(0x08)
	struct UBoxComponent* PARTS1#1; // 0x728(0x08)
	struct UBoxComponent* PARTS1#; // 0x730(0x08)
	struct UStaticMeshComponent* PARTS5#SM_Transtainer_Merge_005; // 0x738(0x08)
	struct UStaticMeshComponent* PARTS4#SM_Transtainer_Merge_004; // 0x740(0x08)
	struct UStaticMeshComponent* PARTS3#SM_Transtainer_Merge_003; // 0x748(0x08)
	struct UStaticMeshComponent* PARTS2#SM_Transtainer_Merge_002; // 0x750(0x08)
	struct UStaticMeshComponent* PARTS1#Switch; // 0x758(0x08)
	struct USplineComponent* SPLINE1#Spline; // 0x760(0x08)
	struct UStaticMeshComponent* WHEEL4#SM_Test_TransTainer_Tire4; // 0x768(0x08)
	struct UStaticMeshComponent* WHEEL3#SM_Test_TransTainer_Tire3; // 0x770(0x08)
	struct UStaticMeshComponent* WHEEL2#SM_Test_TransTainer_Tire2; // 0x778(0x08)
	struct UStaticMeshComponent* WHEEL1#SM_Test_TransTainer_Tire1; // 0x780(0x08)
	struct UStaticMeshComponent* BODY#SM_Merged_FakeMesh_001; // 0x788(0x08)
	struct UStaticMeshComponent* ALIVEOBJ#; // 0x790(0x08)
};

