// BlueprintGeneratedClass BP_WeaponCase_001.BP_WeaponCase_001_C
// Size: 0x268 (Inherited: 0x220)
struct ABP_WeaponCase_001_C : AActor {
	struct UStaticMeshComponent* HK417; // 0x220(0x08)
	struct UStaticMeshComponent* MP5_002; // 0x228(0x08)
	struct UStaticMeshComponent* MP5_001; // 0x230(0x08)
	struct UStaticMeshComponent* MP5_000; // 0x238(0x08)
	struct UStaticMeshComponent* HK416; // 0x240(0x08)
	struct UStaticMeshComponent* AK47; // 0x248(0x08)
	struct UStaticMeshComponent* SM_WeaponCase_002; // 0x250(0x08)
	struct UStaticMeshComponent* SM_WeaponCase_001; // 0x258(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x260(0x08)
};

