// WidgetBlueprintGeneratedClass BreakInto.BreakInto_C
// Size: 0x3d8 (Inherited: 0x380)
struct UBreakInto_C : UPDBreakIntoUI {
	struct UImage* IMG_MapBg; // 0x380(0x08)
	struct UImage* IMG_MapOutline; // 0x388(0x08)
	struct UImage* IMG_PlayerInfo_Bg; // 0x390(0x08)
	struct UImage* IMG_PlayerInfo_Outglow; // 0x398(0x08)
	struct UImage* IMG_PlayerInfo_Outline; // 0x3a0(0x08)
	struct UImage* IMG_SceneBG; // 0x3a8(0x08)
	struct UImage* IMG_TeamArea_Bg; // 0x3b0(0x08)
	struct UCanvasPanel* PW_PlayTimeNum; // 0x3b8(0x08)
	struct URetainerBox* RB_Round; // 0x3c0(0x08)
	struct UPDTextBlock* TB_ATkCaption; // 0x3c8(0x08)
	struct UPDTextBlock* TB_PlayTimeComma; // 0x3d0(0x08)
};

