// WidgetBlueprintGeneratedClass CCTV.CCTV_C
// Size: 0x3d0 (Inherited: 0x2a8)
struct UCCTV_C : UPDCCTVUI {
	struct UWidgetAnimation* AlertStart; // 0x2a8(0x08)
	struct UWidgetAnimation* AlertEnd; // 0x2b0(0x08)
	struct UWidgetAnimation* Anim_Cam; // 0x2b8(0x08)
	struct UWidgetAnimation* Anim_Rec; // 0x2c0(0x08)
	struct UWidgetAnimation* Anim_FocusBar; // 0x2c8(0x08)
	struct UWidgetAnimation* Anim_Equalizer; // 0x2d0(0x08)
	struct UImage* IMG_Cursor; // 0x2d8(0x08)
	struct UImage* IMG_Deco_01; // 0x2e0(0x08)
	struct UImage* IMG_Deco_02; // 0x2e8(0x08)
	struct UImage* IMG_Deco_03; // 0x2f0(0x08)
	struct UImage* IMG_Deco_04; // 0x2f8(0x08)
	struct UImage* IMG_Deco_05; // 0x300(0x08)
	struct UImage* IMG_Deco_06; // 0x308(0x08)
	struct UImage* IMG_Deco_07; // 0x310(0x08)
	struct UImage* IMG_Deco_08; // 0x318(0x08)
	struct UImage* IMG_Deco_Focus_B; // 0x320(0x08)
	struct UImage* IMG_Deco_Focus_L; // 0x328(0x08)
	struct UImage* IMG_Deco_Focus_LB; // 0x330(0x08)
	struct UImage* IMG_Deco_Focus_LT; // 0x338(0x08)
	struct UImage* IMG_Deco_Focus_R; // 0x340(0x08)
	struct UImage* IMG_Deco_Focus_RB; // 0x348(0x08)
	struct UImage* IMG_Deco_Focus_RT; // 0x350(0x08)
	struct UImage* IMG_Deco_Focus_T; // 0x358(0x08)
	struct UImage* IMG_Deco_OutConer_LB; // 0x360(0x08)
	struct UImage* IMG_Deco_OutConer_LT; // 0x368(0x08)
	struct UImage* IMG_Deco_OutConer_RB; // 0x370(0x08)
	struct UImage* IMG_Deco_OutConer_RT; // 0x378(0x08)
	struct UImage* IMG_Deco_PatternB01; // 0x380(0x08)
	struct UImage* IMG_Deco_PatternB02; // 0x388(0x08)
	struct UImage* IMG_Deco_PatternL; // 0x390(0x08)
	struct UImage* IMG_Deco_PatternR; // 0x398(0x08)
	struct UImage* IMG_Deco_PatternT; // 0x3a0(0x08)
	struct UImage* IMG_Equalizer_L; // 0x3a8(0x08)
	struct UImage* IMG_Equalizer_LBg; // 0x3b0(0x08)
	struct UImage* IMG_Equalizer_R; // 0x3b8(0x08)
	struct UImage* IMG_Equalizer_RBg; // 0x3c0(0x08)
	struct UImage* IMG_Focus; // 0x3c8(0x08)
};

