// WidgetBlueprintGeneratedClass ClanInfoPopup.ClanInfoPopup_C
// Size: 0x398 (Inherited: 0x328)
struct UClanInfoPopup_C : UPDClanInfoPopupUI {
	struct UImage* IMG_ActivityIndex; // 0x328(0x08)
	struct UImage* IMG_Bar_01; // 0x330(0x08)
	struct UImage* IMG_Bar_02; // 0x338(0x08)
	struct UImage* IMG_Bar_03; // 0x340(0x08)
	struct UImage* IMG_Bar_04; // 0x348(0x08)
	struct UImage* IMG_Bar_05; // 0x350(0x08)
	struct UImage* IMG_Bar_06; // 0x358(0x08)
	struct UImage* IMG_Bar_07; // 0x360(0x08)
	struct UImage* IMG_Bar_08; // 0x368(0x08)
	struct UImage* IMG_Bar_09; // 0x370(0x08)
	struct UImage* Img_BgBox; // 0x378(0x08)
	struct UImage* IMG_ClanDesc_Bg; // 0x380(0x08)
	struct UImage* IMG_Comunnity_Bg; // 0x388(0x08)
	struct UImage* IMG_SLotBg; // 0x390(0x08)
};

