// WidgetBlueprintGeneratedClass ClanList.ClanList_C
// Size: 0x300 (Inherited: 0x2c0)
struct UClanList_C : UPDClanListUI {
	struct UImage* Img_BottomLine; // 0x2c0(0x08)
	struct UImage* IMG_ClanListContext_Outline; // 0x2c8(0x08)
	struct UImage* IMG_GuideBg; // 0x2d0(0x08)
	struct UImage* IMG_InputBg; // 0x2d8(0x08)
	struct UImage* IMG_MenuBg; // 0x2e0(0x08)
	struct UImage* IMG_Outline; // 0x2e8(0x08)
	struct UImage* IMG_SLotBg; // 0x2f0(0x08)
	struct UImage* IMG_SlotOutline; // 0x2f8(0x08)
};

