// WidgetBlueprintGeneratedClass CommunityPopup.CommunityPopup_C
// Size: 0x418 (Inherited: 0x3a8)
struct UCommunityPopup_C : UPDCommunityPopupUI {
	struct UWidgetAnimation* Anim_SceneOut; // 0x3a8(0x08)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x3b0(0x08)
	struct UImage* IMG_Arrow; // 0x3b8(0x08)
	struct UImage* Img_Bg; // 0x3c0(0x08)
	struct UImage* IMG_CloseBtn_Bg; // 0x3c8(0x08)
	struct UImage* Img_ContentsLine_Bottom; // 0x3d0(0x08)
	struct UImage* Img_ContentsLine_Top; // 0x3d8(0x08)
	struct UImage* IMG_MenuBg; // 0x3e0(0x08)
	struct UImage* IMG_Outline; // 0x3e8(0x08)
	struct UImage* IMG_Outline_L; // 0x3f0(0x08)
	struct UImage* IMG_Outline_T; // 0x3f8(0x08)
	struct UImage* IMG_ToolTipBg; // 0x400(0x08)
	struct UImage* IMG_ToolTipOutline; // 0x408(0x08)
	struct UImage* IMG_TopBg; // 0x410(0x08)
};

