// WidgetBlueprintGeneratedClass CustomCharacterDeco.CustomCharacterDeco_C
// Size: 0x350 (Inherited: 0x300)
struct UCustomCharacterDeco_C : UPDCustomCharacterDecoUI {
	struct UWidgetAnimation* Anim_SceneOut; // 0x300(0x08)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x308(0x08)
	struct UImage* IMG_ActiveBarDeco; // 0x310(0x08)
	struct UImage* IMG_Categorizer; // 0x318(0x08)
	struct UImage* IMG_CategoryBg; // 0x320(0x08)
	struct UImage* IMG_CategoryOutline; // 0x328(0x08)
	struct UImage* IMG_ListBg; // 0x330(0x08)
	struct UImage* IMG_ListOutline; // 0x338(0x08)
	struct UImage* IMG_Outglow_Title; // 0x340(0x08)
	struct UImage* IMG_TitleActiveBar; // 0x348(0x08)
};

