// WidgetBlueprintGeneratedClass CustomJoinPopup.CustomJoinPopup_C
// Size: 0x358 (Inherited: 0x2d8)
struct UCustomJoinPopup_C : UPDCustomJoinPopupUI {
	struct UWidgetAnimation* Anim_SceneOut; // 0x2d8(0x08)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x2e0(0x08)
	struct UImage* IMG_Blinder; // 0x2e8(0x08)
	struct UImage* IMG_BoxGlow; // 0x2f0(0x08)
	struct UImage* IMG_BoxOutline; // 0x2f8(0x08)
	struct UImage* IMG_Deco_BL; // 0x300(0x08)
	struct UImage* IMG_Deco_BR; // 0x308(0x08)
	struct UImage* IMG_Deco_TL; // 0x310(0x08)
	struct UImage* IMG_Deco_TR; // 0x318(0x08)
	struct UImage* IMG_Divider; // 0x320(0x08)
	struct UImage* IMG_InputBg; // 0x328(0x08)
	struct UImage* IMG_Outglow; // 0x330(0x08)
	struct UImage* IMG_Outline; // 0x338(0x08)
	struct UImage* IMG_PopupBg; // 0x340(0x08)
	struct UImage* IMG_TopDeco; // 0x348(0x08)
	struct UImage* IMG_TopDeco_Glow; // 0x350(0x08)
};

