// WidgetBlueprintGeneratedClass CustomWeapon.CustomWeapon_C
// Size: 0x3e0 (Inherited: 0x380)
struct UCustomWeapon_C : UPDCustomWeaponUI {
	struct UWidgetAnimation* Anim_SceneOut; // 0x380(0x08)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x388(0x08)
	struct UImage* IMG_ActiveBarDeco; // 0x390(0x08)
	struct UImage* IMG_CategoryBg; // 0x398(0x08)
	struct UImage* IMG_CategoryOutline; // 0x3a0(0x08)
	struct UImage* IMG_ListBg; // 0x3a8(0x08)
	struct UImage* IMG_ListOutline; // 0x3b0(0x08)
	struct UImage* IMG_Outglow_Title; // 0x3b8(0x08)
	struct UImage* IMG_SkinLIstBg; // 0x3c0(0x08)
	struct UImage* IMG_SkinLIstOutline; // 0x3c8(0x08)
	struct UImage* IMG_Stat_Weapon_Divider; // 0x3d0(0x08)
	struct UImage* IMG_TitleActiveBar; // 0x3d8(0x08)
};

