// WidgetBlueprintGeneratedClass CustomRoom.CustomRoom_C
// Size: 0x4f0 (Inherited: 0x3b0)
struct UCustomRoom_C : UPDCustomRoomUI {
	struct UWidgetAnimation* Anim_SceneOut; // 0x3b0(0x08)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x3b8(0x08)
	struct UImage* IMG_ActiveBarDeco; // 0x3c0(0x08)
	struct UImage* Img_Bg; // 0x3c8(0x08)
	struct UImage* IMG_CharChange_Outline; // 0x3d0(0x08)
	struct UImage* IMG_CharChangeBg; // 0x3d8(0x08)
	struct UImage* IMG_Community_HoverDown; // 0x3e0(0x08)
	struct UImage* IMG_Community_Normal; // 0x3e8(0x08)
	struct UImage* IMG_Defence_DescBg; // 0x3f0(0x08)
	struct UImage* IMG_DefenceDeco; // 0x3f8(0x08)
	struct UImage* IMG_DefenceDeco_2; // 0x400(0x08)
	struct UImage* IMG_DefenceDeco_3; // 0x408(0x08)
	struct UImage* IMG_DefenceDeco_4; // 0x410(0x08)
	struct UImage* IMG_DefenceDeco_5; // 0x418(0x08)
	struct UImage* IMG_DefenceDeco_6; // 0x420(0x08)
	struct UImage* IMG_DefenceDeco_01; // 0x428(0x08)
	struct UImage* IMG_DefenceDeco_02; // 0x430(0x08)
	struct UImage* IMG_DefenceDeco_03; // 0x438(0x08)
	struct UImage* IMG_DefenceDeco_04; // 0x440(0x08)
	struct UImage* IMG_DefenceDeco_05; // 0x448(0x08)
	struct UImage* IMG_DefenceDeco_06; // 0x450(0x08)
	struct UImage* IMG_MapDisabled; // 0x458(0x08)
	struct UImage* IMG_MatchSettingLine; // 0x460(0x08)
	struct UImage* IMG_MenuBg; // 0x468(0x08)
	struct UImage* IMG_Offence_DescBg; // 0x470(0x08)
	struct UImage* IMG_OffenceDeco_01; // 0x478(0x08)
	struct UImage* IMG_OffenceDeco_02; // 0x480(0x08)
	struct UImage* IMG_OffenceDeco_03; // 0x488(0x08)
	struct UImage* IMG_OffenceDeco_04; // 0x490(0x08)
	struct UImage* IMG_OffenceDeco_05; // 0x498(0x08)
	struct UImage* IMG_OffenceDeco_06; // 0x4a0(0x08)
	struct UImage* IMG_OptionIcon_HoverDown; // 0x4a8(0x08)
	struct UImage* IMG_OptionIcon_Normal; // 0x4b0(0x08)
	struct UImage* IMG_Outglow_Agent; // 0x4b8(0x08)
	struct UImage* IMG_Outline; // 0x4c0(0x08)
	struct UImage* IMG_TitleActiveBar; // 0x4c8(0x08)
	struct UImage* IMG_Wait_DescBg; // 0x4d0(0x08)
	struct UImage* IMG_WinDisabled; // 0x4d8(0x08)
	struct UWidgetSwitcher* WS_Btn_Case; // 0x4e0(0x08)
	struct UWidgetSwitcher* WS_Community_Case; // 0x4e8(0x08)
};

