// WidgetBlueprintGeneratedClass DamageScreenIndicator.DamageScreenIndicator_C
// Size: 0x368 (Inherited: 0x328)
struct UDamageScreenIndicator_C : UPDDamageScreenIndicatorUI {
	struct UWidgetAnimation* Anim_Damage_Left; // 0x328(0x08)
	struct UWidgetAnimation* Anim_Damage_LeftDown; // 0x330(0x08)
	struct UWidgetAnimation* Anim_Damage_Down; // 0x338(0x08)
	struct UWidgetAnimation* Anim_Damage_RightDown; // 0x340(0x08)
	struct UWidgetAnimation* Anim_Damage_Right; // 0x348(0x08)
	struct UWidgetAnimation* Anim_Damage_RightUp; // 0x350(0x08)
	struct UWidgetAnimation* Anim_Damage_Up; // 0x358(0x08)
	struct UWidgetAnimation* Anim_Damage_LeftUp; // 0x360(0x08)
};

