// WidgetBlueprintGeneratedClass DebugLog.DebugLog_C
// Size: 0x3e8 (Inherited: 0x388)
struct UDebugLog_C : UPDDebugLogUI {
	struct UWidgetAnimation* Anim_SceneOut; // 0x388(0x08)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x390(0x08)
	struct UImage* IMG_ActiveBarDeco; // 0x398(0x08)
	struct UImage* IMG_Arrow_L; // 0x3a0(0x08)
	struct UImage* IMG_Arrow_R; // 0x3a8(0x08)
	struct UImage* Img_Bg; // 0x3b0(0x08)
	struct UImage* IMG_FileListOutline; // 0x3b8(0x08)
	struct UImage* IMG_ListBg; // 0x3c0(0x08)
	struct UImage* IMG_LogBg; // 0x3c8(0x08)
	struct UImage* IMG_LogOutline; // 0x3d0(0x08)
	struct UImage* IMG_Outglow_Title; // 0x3d8(0x08)
	struct UImage* IMG_TitleActiveBar; // 0x3e0(0x08)
};

