// AnimBlueprintGeneratedClass DefaultPlayer.DefaultPlayer_C
// Size: 0xe5f8 (Inherited: 0x5f0)
struct UDefaultPlayer_C : UPDPlayerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x5f0(0x08)
	struct FAnimNode_Slot AnimGraphNode_Slot_15; // 0x5f8(0x48)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_14; // 0x640(0x1c8)
	struct FAnimNode_Slot AnimGraphNode_Slot_14; // 0x808(0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_54; // 0x850(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x900(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_53; // 0x9a0(0xb0)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_13; // 0xa50(0x1c8)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_12; // 0xc18(0x1c8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_32; // 0xde0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_62; // 0xe98(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_61; // 0xec0(0x28)
	struct FAnimNode_Root AnimGraphNode_Root_7; // 0xee8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0xf18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0xf40(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0xf68(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_52; // 0xfe0(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x1090(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_26; // 0x1108(0x30)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_51; // 0x1138(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_13; // 0x11e8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_12; // 0x1230(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x1278(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_50; // 0x12f0(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_35; // 0x13a0(0xe0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x1480(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_49; // 0x14f8(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_34; // 0x15a8(0xe0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_25; // 0x1688(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0x16b8(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root_6; // 0x1768(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3; // 0x1798(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0x1810(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_33; // 0x18d8(0xe0)
	struct FAnimNode_Root AnimGraphNode_Root_5; // 0x19b8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0x19e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0x1a10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0x1a38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0x1a60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0x1a88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0x1ab0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0x1ad8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0x1b00(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x1b28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x1b50(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_48; // 0x1b78(0xb0)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_11; // 0x1c28(0x1c8)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_10; // 0x1df0(0x1c8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_60; // 0x1fb8(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x1fe0(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0x20a8(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_32; // 0x2170(0xe0)
	struct FAnimNode_PDBlendSpacePlayer AnimGraphNode_PDBlendSpacePlayer_6; // 0x2250(0x2b8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0x2508(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_59; // 0x2538(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_47; // 0x2560(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x2610(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x2688(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x2700(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x2778(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12; // 0x27f0(0xc0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0x28b0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_58; // 0x28e0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0x2908(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_57; // 0x2938(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11; // 0x2960(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_11; // 0x2a20(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_56; // 0x2a68(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x2a90(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0x2ac0(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x2b70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x2b98(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_46; // 0x2bc0(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x2c70(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x2ce8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x2d60(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_55; // 0x2d90(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x2db8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x2de8(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_31; // 0x2e98(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_30; // 0x2f50(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_29; // 0x3008(0xb8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x30c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x30e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x3110(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x3138(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x3160(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x3188(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x31b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x31d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x3200(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x3228(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_54; // 0x3250(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3278(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x3340(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_31; // 0x3408(0xe0)
	struct FAnimNode_PDBlendSpacePlayer AnimGraphNode_PDBlendSpacePlayer_5; // 0x34e8(0x2b8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x37a0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_53; // 0x37d0(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_45; // 0x37f8(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x38a8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x3920(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x3998(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x3a10(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0x3a88(0xc0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x3b48(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_52; // 0x3b78(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x3ba0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_51; // 0x3bd0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50; // 0x3bf8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x3c20(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_10; // 0x3ce0(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x3d28(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x3d58(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_28; // 0x3e08(0xb8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x3ec0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x3ee8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x3f10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x3f38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x3f60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x3f88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x3fb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x3fd8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x4000(0x28)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_9; // 0x4028(0x1c8)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_8; // 0x41f0(0x1c8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_44; // 0x43b8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x4468(0x30)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_7; // 0x4498(0x1c8)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_6; // 0x4660(0x1c8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_43; // 0x4828(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x48d8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_49; // 0x4908(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_5; // 0x4930(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x4988(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_48; // 0x49b8(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_4; // 0x49e0(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x4a38(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x4a68(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x4a98(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_27; // 0x4b48(0xb8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_42; // 0x4c00(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_30; // 0x4cb0(0xe0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x4d90(0xc8)
	struct FAnimNode_PDBlendSpacePlayer AnimGraphNode_PDBlendSpacePlayer_4; // 0x4e58(0x2b8)
	struct FAnimNode_PDBlendSpacePlayer AnimGraphNode_PDBlendSpacePlayer_3; // 0x5110(0x2b8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_26; // 0x53c8(0xb8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_29; // 0x5480(0xe0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x5560(0xc8)
	struct FAnimNode_PDBlendSpacePlayer AnimGraphNode_PDBlendSpacePlayer_2; // 0x5628(0x2b8)
	struct FAnimNode_PDBlendSpacePlayer AnimGraphNode_PDBlendSpacePlayer; // 0x58e0(0x2b8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_25; // 0x5b98(0xb8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x5c50(0xa0)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_5; // 0x5cf0(0x1c8)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_4; // 0x5eb8(0x1c8)
	struct FAnimNode_Root AnimGraphNode_Root_4; // 0x6080(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0x60b0(0x78)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_4; // 0x6128(0xd0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_47; // 0x61f8(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_41; // 0x6220(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_40; // 0x62d0(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_39; // 0x6380(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_24; // 0x6430(0xb8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_38; // 0x64e8(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_28; // 0x6598(0xe0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_23; // 0x6678(0xb8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_27; // 0x6730(0xe0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_26; // 0x6810(0xe0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_25; // 0x68f0(0xe0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_37; // 0x69d0(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_36; // 0x6a80(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_35; // 0x6b30(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_24; // 0x6be0(0xe0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_23; // 0x6cc0(0xe0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_22; // 0x6da0(0xe0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_21; // 0x6e80(0xe0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_3; // 0x6f60(0xd0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_46; // 0x7030(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_34; // 0x7058(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_20; // 0x7108(0xe0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_19; // 0x71e8(0xe0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_22; // 0x72c8(0xb8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x7380(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x7488(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x7590(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x7698(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x77a0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x77c0(0x20)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_33; // 0x77e0(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_45; // 0x7890(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_44; // 0x78b8(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_32; // 0x78e0(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_31; // 0x7990(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43; // 0x7a40(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_30; // 0x7a68(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_18; // 0x7b18(0xe0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_17; // 0x7bf8(0xe0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_16; // 0x7cd8(0xe0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_29; // 0x7db8(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15; // 0x7e68(0xe0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_28; // 0x7f48(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14; // 0x7ff8(0xe0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_27; // 0x80d8(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0x8188(0xe0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x8268(0xe0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_26; // 0x8348(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x83f8(0xe0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_25; // 0x84d8(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x8588(0xe0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_24; // 0x8668(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x8718(0xe0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_23; // 0x87f8(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x88a8(0xe0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x8988(0xe0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x8a68(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x8b08(0xe0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_22; // 0x8be8(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x8c98(0xe0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x8d78(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x8e80(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x8ea0(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0x8ec0(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x8ef0(0x78)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_21; // 0x8f68(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42; // 0x9020(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x9048(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41; // 0x9108(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x9130(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x91a8(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_21; // 0x9220(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x92d0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x9348(0x78)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_20; // 0x93c0(0xb8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_20; // 0x9478(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40; // 0x9528(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_19; // 0x9550(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_18; // 0x9600(0xb0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x96b0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39; // 0x9770(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_17; // 0x9798(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19; // 0x9848(0xb8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x9900(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_16; // 0x9978(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_15; // 0x9a28(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38; // 0x9ad8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37; // 0x9b00(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_14; // 0x9b28(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_13; // 0x9bd8(0xb0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2; // 0x9c88(0xd0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36; // 0x9d58(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_12; // 0x9d80(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0x9e30(0xb8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_11; // 0x9ee8(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_10; // 0x9f98(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_9; // 0xa048(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8; // 0xa0f8(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0xa1a8(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35; // 0xa258(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0xa280(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0xa2f8(0x78)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0xa370(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34; // 0xa428(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33; // 0xa450(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0xa478(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0xa4f0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0xa568(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0xa5e0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0xa658(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xa6d0(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0xa748(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0xa7f8(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32; // 0xa8a8(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0xa8d0(0xd0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31; // 0xa9a0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xa9c8(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0xaa40(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30; // 0xaaf0(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0xab18(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xabc8(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0xac40(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29; // 0xace0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xad08(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0xad80(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28; // 0xae20(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0xae48(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0xae70(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xaf10(0x78)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_3; // 0xaf88(0x58)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_2; // 0xafe0(0x58)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0xb038(0x58)
	struct FAnimNode_Slot AnimGraphNode_Slot_9; // 0xb090(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0xb0d8(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0xb198(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0xb258(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0xb2a0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0xb358(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0xb380(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0xb3a8(0x28)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0xb3d0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0xb400(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0xb428(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0xb450(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xb478(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0xb4a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0xb4c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xb4f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xb518(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xb540(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0xb568(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0xb618(0xe0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0xb6f8(0xe0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0xb7d8(0x30)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_5; // 0xb808(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0xb8b8(0x30)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0xb8e8(0x18)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0xb900(0x30)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xb930(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0xb9e0(0xe0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xbac0(0xe0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0xbba0(0x30)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_4; // 0xbbd0(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0xbc80(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xbcb0(0x28)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0xbcd8(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0xbd88(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0xbe40(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0xbef8(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0xbfb0(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0xc068(0xb8)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance_2; // 0xc120(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0xc1c0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0xc1e8(0xb8)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0xc2a0(0x48)
	bool __CustomProperty_bAimingIdleState_3C7ADD0C48259AE1DF84B89D5192CD5B; // 0xc2e8(0x01)
	char pad_C2E9[0x3]; // 0xc2e9(0x03)
	float __CustomProperty_AimInterpTime_3C7ADD0C48259AE1DF84B89D5192CD5B; // 0xc2ec(0x04)
	bool __CustomProperty_MirrorFinalPose_3C7ADD0C48259AE1DF84B89D5192CD5B; // 0xc2f0(0x01)
	char pad_C2F1[0x7]; // 0xc2f1(0x07)
	struct FPDPerSpecificWeaponAnimDatas __CustomProperty_PSpecificWeaponAnimDatas_3C7ADD0C48259AE1DF84B89D5192CD5B; // 0xc2f8(0xc8)
	bool __CustomProperty_SWStanceIsValid_3C7ADD0C48259AE1DF84B89D5192CD5B; // 0xc3c0(0x01)
	bool __CustomProperty_WStanceIsValid_3C7ADD0C48259AE1DF84B89D5192CD5B; // 0xc3c1(0x01)
	char pad_C3C2[0x6]; // 0xc3c2(0x06)
	struct FPDPWUsingInABPAnimDatas __CustomProperty_PWAnimDatas_3C7ADD0C48259AE1DF84B89D5192CD5B; // 0xc3c8(0x128)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance; // 0xc4f0(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0xc590(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0xc650(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0xc708(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0xc730(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0xc758(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0xc780(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0xc7a8(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0xc7d0(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0xc818(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0xc8d8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xc978(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0xc9a8(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0xca58(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0xca80(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0xcb38(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0xcb60(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0xcba8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0xcbd0(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0xcc90(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0xcd48(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0xcd70(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0xce28(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0xce50(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0xce98(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0xcec0(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xcf60(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0xd020(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_3; // 0xd048(0xb0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2; // 0xd0f8(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0xd1a8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0xd1d0(0xa0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xd270(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xd320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xd348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xd370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xd398(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xd3c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xd3e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xd410(0x28)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_3; // 0xd438(0x1c8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xd600(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xd630(0x28)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer_2; // 0xd658(0x1c8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xd820(0x30)
	struct FAnimNode_PDSequencePlayer AnimGraphNode_PDSequencePlayer; // 0xd850(0x1c8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xda18(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xda48(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xdaf8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0xdb28(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0xdb50(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0xdbf0(0xb8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0xdca8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0xdcc8(0x20)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_2; // 0xdce8(0xf0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xddd8(0x20)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0xddf8(0xf0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xdee8(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0xdf08(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0xdf50(0xb8)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0xe008(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0xe050(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0xe078(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0xe130(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0xe158(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xe180(0xa0)
	struct FAnimNode_Mirror AnimGraphNode_Mirror; // 0xe220(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0xe248(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xe300(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0xe3b8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0xe3e0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0xe408(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0xe430(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xe458(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0xe480(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xe4c8(0xa0)
	struct FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot; // 0xe568(0x90)

	void Facial(struct FPoseLink& Facial); // Function DefaultPlayer.DefaultPlayer_C.Facial // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1b61b60
	void GroggyLocomotion(struct FPoseLink& GroggyLocomotion); // Function DefaultPlayer.DefaultPlayer_C.GroggyLocomotion // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1b61b60
	void FireRecoil(struct FPoseLink InPose_FireRecoil, struct FPoseLink& FireRecoil); // Function DefaultPlayer.DefaultPlayer_C.FireRecoil // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1b61b60
	void DefaultLocomotion(struct FPoseLink& DefaultLocomotion); // Function DefaultPlayer.DefaultPlayer_C.DefaultLocomotion // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1b61b60
