// WidgetBlueprintGeneratedClass EquipPerkList.EquipPerkList_C
// Size: 0x368 (Inherited: 0x328)
struct UEquipPerkList_C : UPDEquipPerkList {
	struct UImage* IMG_BottomBg; // 0x328(0x08)
	struct UImage* IMG_Outglow; // 0x330(0x08)
	struct UImage* IMG_Perk_Alert; // 0x338(0x08)
	struct UImage* IMG_Perk_Alert_Bg; // 0x340(0x08)
	struct UImage* IMG_Perk_Alert_BgBack; // 0x348(0x08)
	struct UImage* IMG_Perk_Alert_Outline; // 0x350(0x08)
	struct UImage* IMG_SkillToolTipBg; // 0x358(0x08)
	struct URichTextBlock* RT_Perk_Alert_Desc; // 0x360(0x08)
};

