// WidgetBlueprintGeneratedClass FindPartyPage.FindPartyPage_C
// Size: 0x3b8 (Inherited: 0x2f8)
struct UFindPartyPage_C : UPDFindPartyPageUI {
	struct UImage* IMG_Brick_Bg; // 0x2f8(0x08)
	struct UImage* IMG_Category_BottomLine; // 0x300(0x08)
	struct UImage* IMG_Category_Line; // 0x308(0x08)
	struct UImage* IMG_FindParty; // 0x310(0x08)
	struct UImage* IMG_FindParty_2; // 0x318(0x08)
	struct UImage* IMG_FindParty_3; // 0x320(0x08)
	struct UImage* IMG_FindParty_Done; // 0x328(0x08)
	struct UImage* IMG_FindParty_Done_Outline; // 0x330(0x08)
	struct UImage* IMG_FindParty_Searching; // 0x338(0x08)
	struct UImage* IMG_FindParty_Searching_Outline; // 0x340(0x08)
	struct UImage* IMG_Menu_Bg; // 0x348(0x08)
	struct UImage* IMG_Menu_Line; // 0x350(0x08)
	struct UImage* IMG_Mode; // 0x358(0x08)
	struct UImage* IMG_Outline_L; // 0x360(0x08)
	struct UImage* IMG_Outline_T; // 0x368(0x08)
	struct UImage* IMG_PartyList_Bg; // 0x370(0x08)
	struct UImage* IMG_Register; // 0x378(0x08)
	struct UImage* IMG_Register_Disabled; // 0x380(0x08)
	struct UImage* IMG_Register_Searching; // 0x388(0x08)
	struct UImage* IMG_Register_Searching_Outline; // 0x390(0x08)
	struct UImage* IMG_RegisterMercenary_Bg; // 0x398(0x08)
	struct UImage* IMG_Voice; // 0x3a0(0x08)
	struct UWidgetSwitcher* WS_Mode; // 0x3a8(0x08)
	struct UWidgetSwitcher* WS_Voice; // 0x3b0(0x08)
};

