// WidgetBlueprintGeneratedClass FriendListItem.FriendListItem_C
// Size: 0x3e0 (Inherited: 0x3a0)
struct UFriendListItem_C : UPDFriendListItem {
	struct UImage* Img_BottomLine; // 0x3a0(0x08)
	struct UImage* IMG_Category_Arrow; // 0x3a8(0x08)
	struct UImage* IMG_Category_BottomLine; // 0x3b0(0x08)
	struct UImage* IMG_Face_Outline; // 0x3b8(0x08)
	struct UImage* IMG_GradeNone_Bg; // 0x3c0(0x08)
	struct UImage* IMG_PictureBg; // 0x3c8(0x08)
	struct UImage* IMG_ToolTipBg; // 0x3d0(0x08)
	struct UImage* IMG_ToolTipOutline; // 0x3d8(0x08)
};

