// WidgetBlueprintGeneratedClass FriendClanItem.FriendClanItem_C
// Size: 0x3b8 (Inherited: 0x378)
struct UFriendClanItem_C : UPDFriendClanItem {
	struct UImage* Img_BottomLine; // 0x378(0x08)
	struct UImage* IMG_Category_Arrow; // 0x380(0x08)
	struct UImage* IMG_Category_BottomLine; // 0x388(0x08)
	struct UImage* IMG_Face_Outline; // 0x390(0x08)
	struct UImage* IMG_GradeNone_Bg; // 0x398(0x08)
	struct UImage* IMG_PictureBg; // 0x3a0(0x08)
	struct UImage* IMG_ToolTipBg; // 0x3a8(0x08)
	struct UImage* IMG_ToolTipOutline; // 0x3b0(0x08)
};

