// WidgetBlueprintGeneratedClass MailPopup.MailPopup_C
// Size: 0x330 (Inherited: 0x2e8)
struct UMailPopup_C : UPDMailPopupUI {
	struct UWidgetAnimation* Anim_SceneOut; // 0x2e8(0x08)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x2f0(0x08)
	struct UImage* Img_Bg; // 0x2f8(0x08)
	struct UImage* IMG_CloseBtn_Bg; // 0x300(0x08)
	struct UImage* Img_ContentsLine_Bottom; // 0x308(0x08)
	struct UImage* Img_ContentsLine_Top; // 0x310(0x08)
	struct UImage* IMG_Outline_L; // 0x318(0x08)
	struct UImage* IMG_Outline_T; // 0x320(0x08)
	struct UImage* IMG_TopBg; // 0x328(0x08)
};

