// WidgetBlueprintGeneratedClass Mail.Mail_C
// Size: 0x340 (Inherited: 0x2e8)
struct UMail_C : UPDMailUI {
	struct UImage* IMG_BottomBar; // 0x2e8(0x08)
	struct UImage* IMG_BoxGlow; // 0x2f0(0x08)
	struct UImage* IMG_ContentBar; // 0x2f8(0x08)
	struct UImage* IMG_Deco_BL; // 0x300(0x08)
	struct UImage* IMG_Deco_BR; // 0x308(0x08)
	struct UImage* IMG_Deco_TL; // 0x310(0x08)
	struct UImage* IMG_Deco_TR; // 0x318(0x08)
	struct UImage* IMG_MailBg; // 0x320(0x08)
	struct UImage* IMG_PopupBg; // 0x328(0x08)
	struct UImage* IMG_TitleBar; // 0x330(0x08)
	struct UImage* IMG_TopBar; // 0x338(0x08)
};

