// WidgetBlueprintGeneratedClass MatchModeList.MatchModeList_C
// Size: 0x350 (Inherited: 0x2f8)
struct UMatchModeList_C : UPDMatchModeList {
	struct UWidgetAnimation* Anim_SceneOut; // 0x2f8(0x08)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x300(0x08)
	struct UImage* Img_Bg; // 0x308(0x08)
	struct UImage* IMG_BottomFx; // 0x310(0x08)
	struct UImage* Img_BottomLine; // 0x318(0x08)
	struct UImage* IMG_Disabled_Bg; // 0x320(0x08)
	struct UImage* IMG_Disabled_Icon; // 0x328(0x08)
	struct UImage* IMG_Disabled_Outline; // 0x330(0x08)
	struct UImage* IMG_MatchingTitle_Hover; // 0x338(0x08)
	struct UImage* IMG_MatchingTitle_Normal; // 0x340(0x08)
	struct UImage* Img_TopLine; // 0x348(0x08)
};

