// WidgetBlueprintGeneratedClass Match.Match_C
// Size: 0x398 (Inherited: 0x2e8)
struct UMatch_C : UPDMatchUI {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2e8(0x08)
	struct UImage* IMG_AnimIndicator_A; // 0x2f0(0x08)
	struct UImage* IMG_AnimIndicator_B; // 0x2f8(0x08)
	struct UImage* IMG_BgCase_Bridge; // 0x300(0x08)
	struct UImage* IMG_BgCase_Derail; // 0x308(0x08)
	struct UImage* IMG_BgCase_Dmitry; // 0x310(0x08)
	struct UImage* IMG_BgCase_Jack; // 0x318(0x08)
	struct UImage* IMG_BgCase_Luna; // 0x320(0x08)
	struct UImage* IMG_BgCase_Nicki; // 0x328(0x08)
	struct UImage* IMG_BgCase_Rose; // 0x330(0x08)
	struct UImage* IMG_BgCase_Shipyard; // 0x338(0x08)
	struct UImage* IMG_BgCase_Simon; // 0x340(0x08)
	struct UImage* IMG_BgCase_Soy; // 0x348(0x08)
	struct UImage* IMG_BgCase_Tutorial; // 0x350(0x08)
	struct UImage* IMG_BgCase_Tyrone; // 0x358(0x08)
	struct UImage* IMG_BgCase_Vignetting; // 0x360(0x08)
	struct UImage* IMG_BgCase_WindFarm; // 0x368(0x08)
	struct UImage* IMG_BgCase_YoungSik; // 0x370(0x08)
	struct UImage* IMG_Black; // 0x378(0x08)
	struct UImage* IMG_DescriptionShade_01; // 0x380(0x08)
	struct UImage* IMG_Divider; // 0x388(0x08)
	struct UImage* IMG_Mode_Outline; // 0x390(0x08)

	void PreConstruct(bool IsDesignTime); // Function Match.Match_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1b61b60
	void ExecuteUbergraph_Match(int32_t EntryPoint); // Function Match.Match_C.ExecuteUbergraph_Match // (Final|UbergraphFunction) // @ game+0x1b61b60
};

