// BlueprintGeneratedClass Merge_BP_WareHouse_Inside_002.Merge_BP_WareHouse_Inside_002_C
// Size: 0x3a8 (Inherited: 0x220)
struct AMerge_BP_WareHouse_Inside_002_C : AActor {
	struct UStaticMeshComponent* SM_BoxReplaceMetal_006; // 0x220(0x08)
	struct UStaticMeshComponent* SM_BoxReplaceMetal_005; // 0x228(0x08)
	struct UStaticMeshComponent* SM_BoxReplaceMetal_004; // 0x230(0x08)
	struct UStaticMeshComponent* SM_BoxReplaceMetal_003; // 0x238(0x08)
	struct UStaticMeshComponent* SM_ElectricPainel_008; // 0x240(0x08)
	struct UStaticMeshComponent* SM_Exit_002; // 0x248(0x08)
	struct UStaticMeshComponent* SM_MERGED_Railing9_002; // 0x250(0x08)
	struct UStaticMeshComponent* SM_MERGED_Railing9_001; // 0x258(0x08)
	struct UStaticMeshComponent* SM_FloorDecal_LetterSmallA3; // 0x260(0x08)
	struct UStaticMeshComponent* SM_FloorDecal_LetterSmallA2; // 0x268(0x08)
	struct UStaticMeshComponent* SM_FloorDecal_LetterSmallA1; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Exit_009; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Exit_008; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Exit_004; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Exit_003; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_ElectricPainel_007; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Exit_001; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_FloorDecal_QuadRed2x3; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_FloorDecal_QuadRed2x2; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_FloorDecal_QuadRed2x1; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_LedLight_001_03; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_LedLight_001_02; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_LedLight_001_01; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_MERGED_DockPipe_005; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_MERGED_DockPipe_004; // 0x2f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent933; // 0x2f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent367; // 0x300(0x08)
	struct UStaticMeshComponent* StaticMeshComponent366; // 0x308(0x08)
	struct UStaticMeshComponent* StaticMeshComponent932; // 0x310(0x08)
	struct UStaticMeshComponent* StaticMeshComponent302; // 0x318(0x08)
	struct UStaticMeshComponent* StaticMeshComponent301; // 0x320(0x08)
	struct UStaticMeshComponent* StaticMeshComponent300; // 0x328(0x08)
	struct UStaticMeshComponent* StaticMeshComponent299; // 0x330(0x08)
	struct UStaticMeshComponent* StaticMeshComponent170; // 0x338(0x08)
	struct UStaticMeshComponent* StaticMeshComponent169; // 0x340(0x08)
	struct UStaticMeshComponent* StaticMeshComponent168; // 0x348(0x08)
	struct UStaticMeshComponent* StaticMeshComponent167; // 0x350(0x08)
	struct UStaticMeshComponent* StaticMeshComponent165; // 0x358(0x08)
	struct UStaticMeshComponent* SM_MERGED_WareCrane_003; // 0x360(0x08)
	struct UStaticMeshComponent* SM_FuseBox_05; // 0x368(0x08)
	struct UStaticMeshComponent* SM_WallWire_015; // 0x370(0x08)
	struct UStaticMeshComponent* SM_FuseBox_04; // 0x378(0x08)
	struct UStaticMeshComponent* SM_WallWire_014; // 0x380(0x08)
	struct UStaticMeshComponent* SM_WallWire_013; // 0x388(0x08)
	struct UStaticMeshComponent* SM_FuseBox_03; // 0x390(0x08)
	struct UStaticMeshComponent* SM_WallLetter_Storage04_____; // 0x398(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x3a0(0x08)
};

