// BlueprintGeneratedClass Merge_BP_Gas_Station_02.Merge_BP_Gas_Station_02_C
// Size: 0x2e0 (Inherited: 0x220)
struct AMerge_BP_Gas_Station_02_C : AActor {
	struct UStaticMeshComponent* SM_Gas_Station_003; // 0x220(0x08)
	struct UStaticMeshComponent* StaticMeshComponent7; // 0x228(0x08)
	struct UStaticMeshComponent* StaticMeshComponent8; // 0x230(0x08)
	struct UStaticMeshComponent* StaticMeshComponent9; // 0x238(0x08)
	struct UStaticMeshComponent* StaticMeshComponent10; // 0x240(0x08)
	struct UStaticMeshComponent* StaticMeshComponent3; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMeshComponent4; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent5; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent6; // 0x260(0x08)
	struct USceneComponent* SharedRoot; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Gas_Station_Shadow_15; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Gas_Station_Shadow_16; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Gas_Station_Shadow_14; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Gas_Station_Shadow_13; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Gas_Station_Shadow_12; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Gas_Station_Shadow_09; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Gas_Station_Shadow_11; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Gas_Station__002; // 0x2a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent20; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent19; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent18; // 0x2c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent17; // 0x2c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent14; // 0x2d0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2d8(0x08)
};

