// BlueprintGeneratedClass Merge_BP_Small_Warehouse_002_06_Epic.Merge_BP_Small_Warehouse_002_06_Epic_C
// Size: 0x2c0 (Inherited: 0x220)
struct AMerge_BP_Small_Warehouse_002_06_Epic_C : AActor {
	struct UStaticMeshComponent* SM_MERGED_SWarehouse_002_06_Decal04; // 0x220(0x08)
	struct UStaticMeshComponent* SM_MERGED_SWarehouse_002_06_Decal03; // 0x228(0x08)
	struct UStaticMeshComponent* SM_MERGED_SWarehouse_002_06_Decal02; // 0x230(0x08)
	struct UStaticMeshComponent* SM_MERGED_SWarehouse_002_06_decal; // 0x238(0x08)
	struct UStaticMeshComponent* SM_SignB_013; // 0x240(0x08)
	struct UStaticMeshComponent* SM_SignB_03; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Hallway_Vent_008; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Hallway_Vent_007; // 0x258(0x08)
	struct UStaticMeshComponent* SM_FirstAidKit_004; // 0x260(0x08)
	struct UStaticMeshComponent* SM_SignB_02; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Hallway_Vent_0011; // 0x270(0x08)
	struct UStaticMeshComponent* SM_SignB_010; // 0x278(0x08)
	struct UStaticMeshComponent* SM_SignB_09; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Hallway_Vent_009; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Hallway_Vent_006; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Hallway_Vent_004; // 0x298(0x08)
	struct UStaticMeshComponent* SM_SignB_12; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_SignB_01; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_SignB_14; // 0x2b0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2b8(0x08)
};

