// BlueprintGeneratedClass Merge_BP_WareHouse_Base_002_Epic.Merge_BP_WareHouse_Base_002_Epic_C
// Size: 0x348 (Inherited: 0x220)
struct AMerge_BP_WareHouse_Base_002_Epic_C : AActor {
	struct UStaticMeshComponent* StaticMesh95; // 0x220(0x08)
	struct UStaticMeshComponent* StaticMesh94; // 0x228(0x08)
	struct UStaticMeshComponent* SM_Warehouse_004_01_Decal04; // 0x230(0x08)
	struct UStaticMeshComponent* SM_Warehouse_004_01_Decal03; // 0x238(0x08)
	struct UStaticMeshComponent* SM_Warehouse_004_01_Decal02; // 0x240(0x08)
	struct UStaticMeshComponent* SM_Warehouse_004_01_Decal01; // 0x248(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x250(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMesh93; // 0x260(0x08)
	struct UStaticMeshComponent* StaticMesh92; // 0x268(0x08)
	struct UStaticMeshComponent* StaticMesh78; // 0x270(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x278(0x08)
	struct UStaticMeshComponent* StaticMesh54; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMesh53; // 0x288(0x08)
	struct UStaticMeshComponent* StaticMesh52; // 0x290(0x08)
	struct UStaticMeshComponent* StaticMesh47; // 0x298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent41; // 0x2a0(0x08)
	struct UStaticMeshComponent* StaticMesh42; // 0x2a8(0x08)
	struct UStaticMeshComponent* StaticMesh37; // 0x2b0(0x08)
	struct UStaticMeshComponent* StaticMesh22; // 0x2b8(0x08)
	struct UStaticMeshComponent* StaticMesh21; // 0x2c0(0x08)
	struct UStaticMeshComponent* StaticMesh14; // 0x2c8(0x08)
	struct UStaticMeshComponent* StaticMesh13; // 0x2d0(0x08)
	struct UStaticMeshComponent* StaticMesh12; // 0x2d8(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0x2e0(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x2e8(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_FuseBox_03; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_FuseBox_02; // 0x300(0x08)
	struct UStaticMeshComponent* SM_WallWire_04; // 0x308(0x08)
	struct UStaticMeshComponent* SM_WallWire_03; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Decal_013; // 0x318(0x08)
	struct UStaticMeshComponent* StaticMesh27; // 0x320(0x08)
	struct UStaticMeshComponent* Sm_Warehouse_Decal_A_001; // 0x328(0x08)
	struct UStaticMeshComponent* StaticMesh56; // 0x330(0x08)
	struct UStaticMeshComponent* StaticMesh57; // 0x338(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x340(0x08)
};

