// WidgetBlueprintGeneratedClass MissionScoreRoundResult.MissionScoreRoundResult_C
// Size: 0x3b0 (Inherited: 0x328)
struct UMissionScoreRoundResult_C : UPDMissionScoreRoundResult {
	struct UImage* Img_Bg; // 0x328(0x08)
	struct UImage* IMG_InfoBoardBg; // 0x330(0x08)
	struct UImage* IMG_InfoBoardBLine; // 0x338(0x08)
	struct UImage* IMG_InfoBoardTLine; // 0x340(0x08)
	struct UMissionScoreRoundResultPlayerInfo_C* PlayerInfo01; // 0x348(0x08)
	struct UMissionScoreRoundResultPlayerInfo_C* PlayerInfo02; // 0x350(0x08)
	struct UMissionScoreRoundResultPlayerInfo_C* PlayerInfo03; // 0x358(0x08)
	struct UMissionScoreRoundResultPlayerInfo_C* PlayerInfo04; // 0x360(0x08)
	struct UMissionScoreRoundResultPlayerInfo_C* PlayerInfo05; // 0x368(0x08)
	struct UMissionScoreRoundResultPlayerInfo_C* PlayerInfo06; // 0x370(0x08)
	struct UMissionScoreRoundResultPlayerInfo_C* PlayerInfo07; // 0x378(0x08)
	struct UMissionScoreRoundResultPlayerInfo_C* PlayerInfo08; // 0x380(0x08)
	struct UMissionScoreRoundResultPlayerInfo_C* PlayerInfo09; // 0x388(0x08)
	struct UMissionScoreRoundResultPlayerInfo_C* PlayerInfo10; // 0x390(0x08)
	struct UMissionScoreRoundResultTopRank_C* TopRank1; // 0x398(0x08)
	struct UMissionScoreRoundResultTopRank_C* TopRank2; // 0x3a0(0x08)
	struct UMissionScoreRoundResultTopRank_C* TopRank3; // 0x3a8(0x08)
};

