// WidgetBlueprintGeneratedClass NickNameCreate.NickNameCreate_C
// Size: 0x338 (Inherited: 0x2b0)
struct UNickNameCreate_C : UPDNickNameCreateUI {
	struct UWidgetAnimation* Anim_InputGlow_Loop; // 0x2b0(0x08)
	struct UWidgetAnimation* Anim_Alert; // 0x2b8(0x08)
	struct UImage* IMG_Alert; // 0x2c0(0x08)
	struct UImage* IMG_AlertBg; // 0x2c8(0x08)
	struct UImage* IMG_Blinder; // 0x2d0(0x08)
	struct UImage* IMG_BoxGlow; // 0x2d8(0x08)
	struct UImage* IMG_BoxOutline; // 0x2e0(0x08)
	struct UImage* IMG_Deco_BL; // 0x2e8(0x08)
	struct UImage* IMG_Deco_BR; // 0x2f0(0x08)
	struct UImage* IMG_Deco_TL; // 0x2f8(0x08)
	struct UImage* IMG_Deco_TR; // 0x300(0x08)
	struct UImage* IMG_InputBg; // 0x308(0x08)
	struct UImage* IMG_Outglow; // 0x310(0x08)
	struct UImage* IMG_Outline; // 0x318(0x08)
	struct UImage* IMG_PopupBg; // 0x320(0x08)
	struct UImage* IMG_TopDeco; // 0x328(0x08)
	struct UImage* IMG_TopDeco_Glow; // 0x330(0x08)
};

