// WidgetBlueprintGeneratedClass OKCancelPopup.OKCancelPopup_C
// Size: 0x350 (Inherited: 0x2f8)
struct UOKCancelPopup_C : UPDOKCancelPopupUI {
	struct UWidgetAnimation* Anim_SceneOut; // 0x2f8(0x08)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x300(0x08)
	struct UImage* IMG_Blinder; // 0x308(0x08)
	struct UImage* IMG_BottomBar; // 0x310(0x08)
	struct UImage* IMG_Deco_BL; // 0x318(0x08)
	struct UImage* IMG_Deco_BR; // 0x320(0x08)
	struct UImage* IMG_Deco_TL; // 0x328(0x08)
	struct UImage* IMG_Deco_TR; // 0x330(0x08)
	struct UImage* IMG_PopupBg; // 0x338(0x08)
	struct UImage* IMG_TopBar; // 0x340(0x08)
	struct UImage* IMG_TopDeco; // 0x348(0x08)
};

