// WidgetBlueprintGeneratedClass OptionPopup.OptionPopup_C
// Size: 0x3f0 (Inherited: 0x398)
struct UOptionPopup_C : UPDOptionPopupUI {
	struct UWidgetAnimation* Anim_SceneOut; // 0x398(0x08)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x3a0(0x08)
	struct UImage* Img_BgBox; // 0x3a8(0x08)
	struct UImage* IMG_Blinder; // 0x3b0(0x08)
	struct UImage* Img_BottomLine; // 0x3b8(0x08)
	struct UImage* Img_ContentsLine_Bottom; // 0x3c0(0x08)
	struct UImage* Img_ContentsLine_Top; // 0x3c8(0x08)
	struct UImage* IMG_Ratings_01; // 0x3d0(0x08)
	struct UImage* IMG_Ratings_02; // 0x3d8(0x08)
	struct UImage* IMG_Ratings_03; // 0x3e0(0x08)
	struct UImage* Img_TopLine; // 0x3e8(0x08)
};

