// WidgetBlueprintGeneratedClass OptionContent.OptionContent_C
// Size: 0x400 (Inherited: 0x3a0)
struct UOptionContent_C : UPDOptionContent {
	struct UImage* IMG_CrossHairB; // 0x3a0(0x08)
	struct UImage* IMG_CrossHairC; // 0x3a8(0x08)
	struct UImage* IMG_CrossHairC_2; // 0x3b0(0x08)
	struct UImage* IMG_CrossHairC_B; // 0x3b8(0x08)
	struct UImage* IMG_CrossHairC_C; // 0x3c0(0x08)
	struct UImage* IMG_CrossHairC_L; // 0x3c8(0x08)
	struct UImage* IMG_CrossHairC_R; // 0x3d0(0x08)
	struct UImage* IMG_CrossHairC_T; // 0x3d8(0x08)
	struct UImage* IMG_CrossHairL; // 0x3e0(0x08)
	struct UImage* IMG_CrossHairR; // 0x3e8(0x08)
	struct UImage* IMG_Outline; // 0x3f0(0x08)
	struct UImage* IMG_Outline_2; // 0x3f8(0x08)
};

