// WidgetBlueprintGeneratedClass OutGameTopMenu.OutGameTopMenu_C
// Size: 0x518 (Inherited: 0x440)
struct UOutGameTopMenu_C : UPDOutGameTopMenu {
	struct UWidgetAnimation* Anim_SceneOut_Agent; // 0x440(0x08)
	struct UWidgetAnimation* Anim_SceneOut_Lobby; // 0x448(0x08)
	struct UWidgetAnimation* Anim_SceneShowUp_Agent; // 0x450(0x08)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x458(0x08)
	struct UPDButton_C* BTN_GradeNone; // 0x460(0x08)
	struct UImage* IMG_ActiveBarDeco_Clan; // 0x468(0x08)
	struct UImage* IMG_ActiveBarDeco_Customizing; // 0x470(0x08)
	struct UImage* IMG_ActiveBarDeco_GameGuide; // 0x478(0x08)
	struct UImage* IMG_ActiveBarDeco_Training; // 0x480(0x08)
	struct UImage* IMG_CurrencyIcon; // 0x488(0x08)
	struct UImage* IMG_GradeNone; // 0x490(0x08)
	struct UImage* IMG_MailBoxIcon; // 0x498(0x08)
	struct UImage* IMG_MenuBg; // 0x4a0(0x08)
	struct UImage* IMG_MenuOutglow; // 0x4a8(0x08)
	struct UImage* IMG_OptionIcon_HoverDown; // 0x4b0(0x08)
	struct UImage* IMG_OptionIcon_Normal; // 0x4b8(0x08)
	struct UImage* IMG_Outline; // 0x4c0(0x08)
	struct UImage* IMG_PDLogo; // 0x4c8(0x08)
	struct UImage* IMG_Register; // 0x4d0(0x08)
	struct UImage* IMG_Register_Disabled; // 0x4d8(0x08)
	struct UImage* IMG_Register_Searching; // 0x4e0(0x08)
	struct UImage* IMG_Register_Searching_Outline; // 0x4e8(0x08)
	struct UImage* IMG_SlotDivider_2; // 0x4f0(0x08)
	struct UImage* IMG_SlotDivider_3; // 0x4f8(0x08)
	struct UImage* IMG_ToolTipBg; // 0x500(0x08)
	struct UImage* IMG_ToolTipOutline; // 0x508(0x08)
	struct UWidgetSwitcher* WS_Btn_Case; // 0x510(0x08)
};

