// WidgetBlueprintGeneratedClass PartySlotListItem.PartySlotListItem_C
// Size: 0x388 (Inherited: 0x328)
struct UPartySlotListItem_C : UPDPartySlotListItemUI {
	struct UWidgetAnimation* Anim_Inviting_Loop; // 0x328(0x08)
	struct UImage* IMG_Filled_Outline; // 0x330(0x08)
	struct UImage* IMG_FilledBg; // 0x338(0x08)
	struct UImage* IMG_Idle; // 0x340(0x08)
	struct UImage* IMG_Invite_Indicator; // 0x348(0x08)
	struct UImage* IMG_Inviting_Outline; // 0x350(0x08)
	struct UImage* IMG_InvitingBg; // 0x358(0x08)
	struct UImage* IMG_Leader; // 0x360(0x08)
	struct UImage* IMG_LeaderBg; // 0x368(0x08)
	struct UImage* IMG_Muted; // 0x370(0x08)
	struct UImage* IMG_NotJoined; // 0x378(0x08)
	struct UImage* IMG_Speaking; // 0x380(0x08)
};

