// WidgetBlueprintGeneratedClass Perk.Perk_C
// Size: 0x440 (Inherited: 0x3c8)
struct UPerk_C : UPDPerkUI {
	struct UImage* IMG_MouseIcon; // 0x3c8(0x08)
	struct UPDImage* IMG_SLotBg; // 0x3d0(0x08)
	struct UPDImage* IMG_SlotBG01; // 0x3d8(0x08)
	struct UPDImage* IMG_SlotBG02; // 0x3e0(0x08)
	struct UPDImage* IMG_SlotBG03; // 0x3e8(0x08)
	struct UPDImage* IMG_SlotBG04; // 0x3f0(0x08)
	struct UPDImage* IMG_SlotBG05; // 0x3f8(0x08)
	struct UPDImage* IMG_SlotBG06; // 0x400(0x08)
	struct UPerkEntryItem_C* PEI_Perk01; // 0x408(0x08)
	struct UPerkEntryItem_C* PEI_Perk02; // 0x410(0x08)
	struct UPerkEntryItem_C* PEI_Perk03; // 0x418(0x08)
	struct UPerkEntryItem_C* PEI_Perk04; // 0x420(0x08)
	struct UPerkEntryItem_C* PEI_Perk05; // 0x428(0x08)
	struct URetainerBox* RB_Alert; // 0x430(0x08)
	struct URetainerBox* RB_Signature; // 0x438(0x08)
};

