// WidgetBlueprintGeneratedClass PlayerCheer.PlayerCheer_C
// Size: 0x370 (Inherited: 0x320)
struct UPlayerCheer_C : UPDPlayerCheer {
	struct UWidgetAnimation* NewAnimation; // 0x320(0x08)
	struct UWidgetAnimation* Ani_Cheer3; // 0x328(0x08)
	struct UWidgetAnimation* Ani_Cheer2; // 0x330(0x08)
	struct UWidgetAnimation* Ani_Cheer1; // 0x338(0x08)
	struct UImage* IMG_Cheer1; // 0x340(0x08)
	struct UImage* IMG_Cheer1_2; // 0x348(0x08)
	struct UImage* IMG_Cheer2; // 0x350(0x08)
	struct UImage* IMG_Cheer2_2; // 0x358(0x08)
	struct UImage* IMG_Cheer3; // 0x360(0x08)
	struct UImage* IMG_Cheer3_2; // 0x368(0x08)
};

