// WidgetBlueprintGeneratedClass PlayerEntryItemAlly.PlayerEntryItemAlly_C
// Size: 0x340 (Inherited: 0x300)
struct UPlayerEntryItemAlly_C : UPDPlayerEntryItemAllyUI {
	struct UWidgetAnimation* CarrySeed; // 0x300(0x08)
	struct UWidgetAnimation* BeHit; // 0x308(0x08)
	struct UImage* IMG_Idle; // 0x310(0x08)
	struct UImage* IMG_Idle_2; // 0x318(0x08)
	struct UImage* IMG_Idle_3; // 0x320(0x08)
	struct UImage* IMG_Juggernaut; // 0x328(0x08)
	struct UImage* IMG_Juggernaut_light; // 0x330(0x08)
	struct UImage* IMG_Muted; // 0x338(0x08)
};

