// WidgetBlueprintGeneratedClass PlayerInfo.PlayerInfo_C
// Size: 0x4e0 (Inherited: 0x470)
struct UPlayerInfo_C : UPDPlayerInfoUI {
	struct UWidgetAnimation* AnimBow; // 0x470(0x08)
	struct UWidgetAnimation* HPAlretEnd; // 0x478(0x08)
	struct UWidgetAnimation* HPAlretStart; // 0x480(0x08)
	struct UWidgetAnimation* CarryBomb; // 0x488(0x08)
	struct UImage* IMG_BasicBack; // 0x490(0x08)
	struct UImage* IMG_BasicBack_2; // 0x498(0x08)
	struct UImage* IMG_Eject; // 0x4a0(0x08)
	struct UImage* IMG_Line; // 0x4a8(0x08)
	struct UImage* IMG_Line_2; // 0x4b0(0x08)
	struct UImage* IMG_Logo_2; // 0x4b8(0x08)
	struct UImage* IMG_Logo_3; // 0x4c0(0x08)
	struct UPDImage* PDImage; // 0x4c8(0x08)
	struct UPDImage* PDImage_5; // 0x4d0(0x08)
	struct UPlayerEquipmentSlotS_C* PlayerEquipmentSlotS; // 0x4d8(0x08)
};

