// WidgetBlueprintGeneratedClass PlayerEquipSlotThrowable.PlayerEquipSlotThrowable_C
// Size: 0x400 (Inherited: 0x380)
struct UPlayerEquipSlotThrowable_C : UPDPlayerEquipmentSlotMulti {
	struct UImage* IMG_Icon_ActiveMelee; // 0x380(0x08)
	struct UImage* IMG_Icon_ActiveSub; // 0x388(0x08)
	struct UImage* IMG_Icon_ActiveWp; // 0x390(0x08)
	struct UImage* IMG_Line; // 0x398(0x08)
	struct UImage* IMG_Logo; // 0x3a0(0x08)
	struct UProgressBar* PB_Progress_Sub; // 0x3a8(0x08)
	struct UProgressBar* PB_Progress_Wp; // 0x3b0(0x08)
	struct UPDImage* PDImage_5; // 0x3b8(0x08)
	struct UPDTextBlock* TB_CurrentRounds; // 0x3c0(0x08)
	struct UPDTextBlock* TB_FireMode; // 0x3c8(0x08)
	struct UPDTextBlock* TB_Num_2; // 0x3d0(0x08)
	struct UPDTextBlock* TB_Num_3; // 0x3d8(0x08)
	struct UPDTextBlock* TB_Num_4; // 0x3e0(0x08)
	struct UPDTextBlock* TB_Num_Active; // 0x3e8(0x08)
	struct UPDTextBlock* TB_StackCount; // 0x3f0(0x08)
	struct UPDTextBlock* TB_TotalRounds; // 0x3f8(0x08)
};

