// WidgetBlueprintGeneratedClass PlayerEquipmentSlot.PlayerEquipmentSlot_C
// Size: 0x368 (Inherited: 0x2f0)
struct UPlayerEquipmentSlot_C : UPDPlayerEquipmentSlotBase {
	struct UImage* IMG_Icon_ActiveMelee; // 0x2f0(0x08)
	struct UImage* IMG_Icon_ActiveSub; // 0x2f8(0x08)
	struct UImage* IMG_Icon_ActiveWp; // 0x300(0x08)
	struct UImage* IMG_Line; // 0x308(0x08)
	struct UImage* IMG_Logo; // 0x310(0x08)
	struct UProgressBar* PB_Progress_Sub; // 0x318(0x08)
	struct UProgressBar* PB_Progress_Wp; // 0x320(0x08)
	struct UPDImage* PDImage_5; // 0x328(0x08)
	struct UPDTextBlock* TB_CurrentRounds; // 0x330(0x08)
	struct UPDTextBlock* TB_FireMode; // 0x338(0x08)
	struct UPDTextBlock* TB_Num_2; // 0x340(0x08)
	struct UPDTextBlock* TB_Num_3; // 0x348(0x08)
	struct UPDTextBlock* TB_Num_Active; // 0x350(0x08)
	struct UPDTextBlock* TB_StackCount; // 0x358(0x08)
	struct UPDTextBlock* TB_TotalRounds; // 0x360(0x08)
};

