// WidgetBlueprintGeneratedClass PlayLog.PlayLog_C
// Size: 0x598 (Inherited: 0x458)
struct UPlayLog_C : UPDPlayLogUI {
	struct UWidgetAnimation* Anim_SceneOut; // 0x458(0x08)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x460(0x08)
	struct UImage* IMG_ActiveBarDeco; // 0x468(0x08)
	struct UImage* IMG_AnimIndicator_A; // 0x470(0x08)
	struct UImage* Img_Bg; // 0x478(0x08)
	struct UImage* IMG_BottomBar; // 0x480(0x08)
	struct UImage* IMG_Deco_BL; // 0x488(0x08)
	struct UImage* IMG_Deco_BR; // 0x490(0x08)
	struct UImage* IMG_Deco_TL; // 0x498(0x08)
	struct UImage* IMG_Deco_TR; // 0x4a0(0x08)
	struct UImage* IMG_Divider_Attack; // 0x4a8(0x08)
	struct UImage* IMG_Divider_Defence; // 0x4b0(0x08)
	struct UImage* IMG_LodingBg; // 0x4b8(0x08)
	struct UImage* IMG_MapBg; // 0x4c0(0x08)
	struct UImage* IMG_MapNameBg; // 0x4c8(0x08)
	struct UImage* IMG_MapNameOutline; // 0x4d0(0x08)
	struct UImage* IMG_MapOutline; // 0x4d8(0x08)
	struct UImage* IMG_Outglow_Title; // 0x4e0(0x08)
	struct UImage* IMG_PauseDeco01; // 0x4e8(0x08)
	struct UImage* IMG_PauseDeco02; // 0x4f0(0x08)
	struct UImage* IMG_PlayDeco; // 0x4f8(0x08)
	struct UImage* IMG_PlayerInfoBg_Attack; // 0x500(0x08)
	struct UImage* IMG_PlayerInfoBg_Defence; // 0x508(0x08)
	struct UImage* IMG_PlayerInfoOutline_Attack; // 0x510(0x08)
	struct UImage* IMG_PlayerInfoOutline_Defence; // 0x518(0x08)
	struct UImage* IMG_PlayerInfoTitleLine_Attack; // 0x520(0x08)
	struct UImage* IMG_PlayerInfoTitleLine_Defence; // 0x528(0x08)
	struct UImage* IMG_PlayListBg; // 0x530(0x08)
	struct UImage* IMG_PlayListOutline; // 0x538(0x08)
	struct UImage* IMG_PlayListTitleLine; // 0x540(0x08)
	struct UImage* IMG_PopupBg; // 0x548(0x08)
	struct UImage* IMG_RoundListBg; // 0x550(0x08)
	struct UImage* IMG_RoundListOutline; // 0x558(0x08)
	struct UImage* IMG_RoundListTitleLine; // 0x560(0x08)
	struct UImage* IMG_SliderBg; // 0x568(0x08)
	struct UImage* IMG_SliderLine; // 0x570(0x08)
	struct UImage* IMG_SliderOutline; // 0x578(0x08)
	struct UImage* IMG_StopDeco; // 0x580(0x08)
	struct UImage* IMG_TitleActiveBar; // 0x588(0x08)
	struct UImage* IMG_TopBar; // 0x590(0x08)
};

