// WidgetBlueprintGeneratedClass RecruitListItem.RecruitListItem_C
// Size: 0x370 (Inherited: 0x330)
struct URecruitListItem_C : UPDRecruitListItem {
	struct UImage* Img_BottomLine; // 0x330(0x08)
	struct UImage* IMG_Cancel; // 0x338(0x08)
	struct UImage* IMG_Canceled; // 0x340(0x08)
	struct UImage* IMG_Face_Outline; // 0x348(0x08)
	struct UImage* IMG_Invite_Indicator_4; // 0x350(0x08)
	struct UImage* IMG_Join; // 0x358(0x08)
	struct UImage* IMG_PictureBg; // 0x360(0x08)
	struct UImage* IMG_RecuritFalied; // 0x368(0x08)
};

