// WidgetBlueprintGeneratedClass ResultRankScore.ResultRankScore_C
// Size: 0x338 (Inherited: 0x2c8)
struct UResultRankScore_C : UPDResultRankScore {
	struct UWidgetAnimation* appear; // 0x2c8(0x08)
	struct UImage* IMG_ScoreBoard_Line03; // 0x2d0(0x08)
	struct UImage* IMG_ScoreBoard_TopBg02; // 0x2d8(0x08)
	struct UImage* IMG_ScoreBoard_TopDeco; // 0x2e0(0x08)
	struct UResultRankScoreItem_C* RankScoreItem01; // 0x2e8(0x08)
	struct UResultRankScoreItem_C* RankScoreItem02; // 0x2f0(0x08)
	struct UResultRankScoreItem_C* RankScoreItem03; // 0x2f8(0x08)
	struct UResultRankScoreItem_C* RankScoreItem04; // 0x300(0x08)
	struct UResultRankScoreItem_C* RankScoreItem05; // 0x308(0x08)
	struct UResultRankScoreItem_C* RankScoreItem06; // 0x310(0x08)
	struct UResultRankScoreItem_C* RankScoreItem07; // 0x318(0x08)
	struct UResultRankScoreItem_C* RankScoreItem08; // 0x320(0x08)
	struct UResultRankScoreItem_C* RankScoreItem09; // 0x328(0x08)
	struct UResultRankScoreItem_C* RankScoreItem10; // 0x330(0x08)
};

