// WidgetBlueprintGeneratedClass RingCommand.RingCommand_C
// Size: 0x500 (Inherited: 0x4c0)
struct URingCommand_C : UPDRingCommandUI {
	struct UImage* Image; // 0x4c0(0x08)
	struct UImage* Image_2; // 0x4c8(0x08)
	struct UImage* IMG_ArrowL; // 0x4d0(0x08)
	struct UImage* IMG_ArrowR; // 0x4d8(0x08)
	struct UImage* IMG_Back1; // 0x4e0(0x08)
	struct UImage* IMG_Back2_1; // 0x4e8(0x08)
	struct UImage* IMG_Back2_2; // 0x4f0(0x08)
	struct UImage* IMG_MouseR; // 0x4f8(0x08)
};

