// WidgetBlueprintGeneratedClass RoundInfo.RoundInfo_C
// Size: 0x428 (Inherited: 0x3b8)
struct URoundInfo_C : UPDRoundInfoUI {
	struct UWidgetAnimation* TimeAlret; // 0x3b8(0x08)
	struct UWidgetAnimation* BombDefuse; // 0x3c0(0x08)
	struct UWidgetAnimation* BombCount; // 0x3c8(0x08)
	struct UWidgetAnimation* BombSet; // 0x3d0(0x08)
	struct UImage* IMG_InfoBackM; // 0x3d8(0x08)
	struct UImage* IMG_ShopGuide_Bg; // 0x3e0(0x08)
	struct UImage* IMG_ShopGuide_Outline; // 0x3e8(0x08)
	struct UImage* IMG_ShopGuide_TitleBar; // 0x3f0(0x08)
	struct UImage* IMG_ShopGuide_TitleDecoL; // 0x3f8(0x08)
	struct UImage* IMG_ShopGuide_TitleDecoR; // 0x400(0x08)
	struct UCanvasPanel* PW_PlayTimeNum; // 0x408(0x08)
	struct UPDTextBlock* TB_PlayTimeComma; // 0x410(0x08)
	struct UPDTextBlock* TB_PlayTimeMin; // 0x418(0x08)
	struct UPDTextBlock* TB_PlayTimeSec; // 0x420(0x08)
};

