// BlueprintGeneratedClass Shipyard_Barge_01.Shipyard_Barge_01_C
// Size: 0x2a8 (Inherited: 0x220)
struct AShipyard_Barge_01_C : AActor {
	struct UStaticMeshComponent* SM_Shipyard_Barge_015; // 0x220(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Barge_014; // 0x228(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Barge_013; // 0x230(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Barge_012; // 0x238(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Barge_011; // 0x240(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Barge_10; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Barge_9; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Barge_010; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Barge_09; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Barge_08; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Barge_07; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Barge_06; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Barge_05; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Barge_03; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Barge_02; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Shipyard_Barge_01; // 0x298(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2a0(0x08)
};

