// WidgetBlueprintGeneratedClass SkyView.SkyView_C
// Size: 0x3f0 (Inherited: 0x358)
struct USkyView_C : UPDSkyViewUI {
	struct UWidgetAnimation* AlertStart; // 0x358(0x08)
	struct UWidgetAnimation* AlertEnd; // 0x360(0x08)
	struct UWidgetAnimation* Anim_Cam; // 0x368(0x08)
	struct UWidgetAnimation* Anim_Rec; // 0x370(0x08)
	struct UWidgetAnimation* Anim_FocusBar; // 0x378(0x08)
	struct UWidgetAnimation* Anim_Equalizer; // 0x380(0x08)
	struct UPDImage* IMG_AlertBack; // 0x388(0x08)
	struct UImage* IMG_AtkIcon; // 0x390(0x08)
	struct UPDImage* IMG_Deco; // 0x398(0x08)
	struct UImage* IMG_DefIcon; // 0x3a0(0x08)
	struct UImage* IMG_MapBg; // 0x3a8(0x08)
	struct UImage* IMG_MapShadow; // 0x3b0(0x08)
	struct UImage* IMG_MissionIcon; // 0x3b8(0x08)
	struct UPDImage* IMG_Recently01Back; // 0x3c0(0x08)
	struct UPDImage* IMG_Recently02Back; // 0x3c8(0x08)
	struct UPDTextBlock* TB_ATkCaption; // 0x3d0(0x08)
	struct UPDTextBlock* TB_DefCaption; // 0x3d8(0x08)
	struct UPDTextBlock* TB_MissionScoreSubTitle; // 0x3e0(0x08)
	struct UPDTextBlock* TB_MissionScoreTitle; // 0x3e8(0x08)
};

