// WidgetBlueprintGeneratedClass SpectatorPlayerAlly.SpectatorPlayerAlly_C
// Size: 0x648 (Inherited: 0x5a0)
struct USpectatorPlayerAlly_C : UPDSpectatorEntryAlly {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x5a0(0x08)
	struct UWidgetAnimation* HealthAlert; // 0x5a8(0x08)
	struct UWidgetAnimation* Damage; // 0x5b0(0x08)
	struct UImage* IMG_ArmorBg; // 0x5b8(0x08)
	struct UImage* IMG_NameBG; // 0x5c0(0x08)
	struct UImage* IMG_PlayerNameBg; // 0x5c8(0x08)
	struct UImage* IMG_PlayerNameBg_Dead; // 0x5d0(0x08)
	struct UImage* IMG_PlayerPicBlind_Dead; // 0x5d8(0x08)
	struct UImage* IMG_PlayerState_Dead; // 0x5e0(0x08)
	struct UImage* IMG_SlotBG01_Dead; // 0x5e8(0x08)
	struct UImage* IMG_SlotBG02_Dead; // 0x5f0(0x08)
	struct UImage* IMG_SlotBG03_Dead; // 0x5f8(0x08)
	struct UImage* IMG_SlotBG04_Dead; // 0x600(0x08)
	struct UImage* IMG_SlotBG05_Dead; // 0x608(0x08)
	struct UImage* IMG_SlotBG06_Dead; // 0x610(0x08)
	struct UImage* IMG_SlotBG07_Dead; // 0x618(0x08)
	struct UImage* IMG_SlotBGAgent_Dead; // 0x620(0x08)
	struct UImage* IMG_SlotBGMelee_Dead; // 0x628(0x08)
	struct UImage* IMG_SlotBGRevival_Dead; // 0x630(0x08)
	struct UImage* IMG_SlotBGSeed_Dead; // 0x638(0x08)
	struct UImage* IMG_SlotOutline; // 0x640(0x08)

	void Construct(); // Function SpectatorPlayerAlly.SpectatorPlayerAlly_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1b61b60
	void ExecuteUbergraph_SpectatorPlayerAlly(int32_t EntryPoint); // Function SpectatorPlayerAlly.SpectatorPlayerAlly_C.ExecuteUbergraph_SpectatorPlayerAlly // (Final|UbergraphFunction) // @ game+0x1b61b60
};

