// WidgetBlueprintGeneratedClass SpectatorPlayerEnemy.SpectatorPlayerEnemy_C
// Size: 0x4f8 (Inherited: 0x498)
struct USpectatorPlayerEnemy_C : UPDSpectatorPlayerEntry {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x498(0x08)
	struct UImage* IMG_NameBG; // 0x4a0(0x08)
	struct UImage* IMG_PlayerNameBg; // 0x4a8(0x08)
	struct UImage* IMG_PlayerNameBg_Dead; // 0x4b0(0x08)
	struct UImage* IMG_PlayerPicBlind_Dead; // 0x4b8(0x08)
	struct UImage* IMG_PlayerState; // 0x4c0(0x08)
	struct UImage* IMG_PlayerState_Dead; // 0x4c8(0x08)
	struct UImage* IMG_SlotBG01_Dead; // 0x4d0(0x08)
	struct UImage* IMG_SlotBG02_Dead; // 0x4d8(0x08)
	struct UImage* IMG_SlotBG03_Dead; // 0x4e0(0x08)
	struct UImage* IMG_SlotBGMelee_Dead; // 0x4e8(0x08)
	struct UImage* IMG_SlotOutline; // 0x4f0(0x08)

	void Construct(); // Function SpectatorPlayerEnemy.SpectatorPlayerEnemy_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1b61b60
	void ExecuteUbergraph_SpectatorPlayerEnemy(int32_t EntryPoint); // Function SpectatorPlayerEnemy.SpectatorPlayerEnemy_C.ExecuteUbergraph_SpectatorPlayerEnemy // (Final|UbergraphFunction) // @ game+0x1b61b60
};

