// WidgetBlueprintGeneratedClass Spectator.Spectator_C
// Size: 0x3f0 (Inherited: 0x320)
struct USpectator_C : UPDSpectatorUI {
	struct UWidgetAnimation* Ani_PressF3; // 0x320(0x08)
	struct UWidgetAnimation* Ani_PressF2; // 0x328(0x08)
	struct UWidgetAnimation* Ani_PressF1; // 0x330(0x08)
	struct UImage* IMG_CheerIcon01; // 0x338(0x08)
	struct UImage* IMG_CheerIcon02; // 0x340(0x08)
	struct UImage* IMG_CheerIcon03; // 0x348(0x08)
	struct UImage* IMG_GradeNone; // 0x350(0x08)
	struct UImage* IMG_Mouse_L; // 0x358(0x08)
	struct UImage* IMG_Mouse_R; // 0x360(0x08)
	struct UImage* IMG_Next; // 0x368(0x08)
	struct UImage* IMG_Prev; // 0x370(0x08)
	struct USpectatorPlayerAlly_C* PlayerAlly_1; // 0x378(0x08)
	struct USpectatorPlayerAlly_C* PlayerAlly_2; // 0x380(0x08)
	struct USpectatorPlayerAlly_C* PlayerAlly_3; // 0x388(0x08)
	struct USpectatorPlayerAlly_C* PlayerAlly_4; // 0x390(0x08)
	struct USpectatorPlayerAlly_C* PlayerAlly_5; // 0x398(0x08)
	struct USpectatorPlayerEnemy_C* PlayerEnemy_1; // 0x3a0(0x08)
	struct USpectatorPlayerEnemy_C* PlayerEnemy_2; // 0x3a8(0x08)
	struct USpectatorPlayerEnemy_C* PlayerEnemy_3; // 0x3b0(0x08)
	struct USpectatorPlayerEnemy_C* PlayerEnemy_4; // 0x3b8(0x08)
	struct USpectatorPlayerEnemy_C* PlayerEnemy_5; // 0x3c0(0x08)
	struct USpectator_Cheer_C* SC1; // 0x3c8(0x08)
	struct USpectator_Cheer_C* SC1_2; // 0x3d0(0x08)
	struct USpectator_Cheer_C* SC1_3; // 0x3d8(0x08)
	struct USpectator_Cheer_C* SC1_4; // 0x3e0(0x08)
	struct USpectator_Cheer_C* SC1_5; // 0x3e8(0x08)
};

