// WidgetBlueprintGeneratedClass StatusBoardMap.StatusBoardMap_C
// Size: 0x4e0 (Inherited: 0x450)
struct UStatusBoardMap_C : UPDStatusBoardGameMap {
	struct UImage* IMG_Coordinate_H01; // 0x450(0x08)
	struct UImage* IMG_Coordinate_H02; // 0x458(0x08)
	struct UImage* IMG_Coordinate_H03; // 0x460(0x08)
	struct UImage* IMG_Coordinate_H04; // 0x468(0x08)
	struct UImage* IMG_Coordinate_H05; // 0x470(0x08)
	struct UImage* IMG_Coordinate_H06; // 0x478(0x08)
	struct UImage* IMG_Coordinate_H07; // 0x480(0x08)
	struct UImage* IMG_Coordinate_H08; // 0x488(0x08)
	struct UImage* IMG_Coordinate_H09; // 0x490(0x08)
	struct UImage* IMG_Coordinate_V01; // 0x498(0x08)
	struct UImage* IMG_Coordinate_V02; // 0x4a0(0x08)
	struct UImage* IMG_Coordinate_V03; // 0x4a8(0x08)
	struct UImage* IMG_Coordinate_V04; // 0x4b0(0x08)
	struct UImage* IMG_Coordinate_V05; // 0x4b8(0x08)
	struct UImage* IMG_Coordinate_V06; // 0x4c0(0x08)
	struct UImage* IMG_Coordinate_V07; // 0x4c8(0x08)
	struct UImage* IMG_Coordinate_V08; // 0x4d0(0x08)
	struct UImage* IMG_Coordinate_V09; // 0x4d8(0x08)
};

