// WidgetBlueprintGeneratedClass TutorialPopup.TutorialPopup_C
// Size: 0x3d8 (Inherited: 0x350)
struct UTutorialPopup_C : UPDTutorialPopupUI {
	struct UWidgetAnimation* Anim_SceneOut; // 0x350(0x08)
	struct UWidgetAnimation* Anim_SceneShowUp; // 0x358(0x08)
	struct UImage* Img_Bg; // 0x360(0x08)
	struct UImage* IMG_Blinder; // 0x368(0x08)
	struct UImage* IMG_Comp_Reward_01; // 0x370(0x08)
	struct UImage* IMG_Comp_Reward_02; // 0x378(0x08)
	struct UImage* IMG_CompDeco_Reward_01; // 0x380(0x08)
	struct UImage* IMG_CompDeco_Reward_02; // 0x388(0x08)
	struct UImage* IMG_Deco_BL; // 0x390(0x08)
	struct UImage* IMG_Deco_BR; // 0x398(0x08)
	struct UImage* IMG_Deco_line_01; // 0x3a0(0x08)
	struct UImage* IMG_Deco_line_02; // 0x3a8(0x08)
	struct UImage* IMG_Deco_line_03; // 0x3b0(0x08)
	struct UImage* IMG_Deco_TL; // 0x3b8(0x08)
	struct UImage* IMG_Deco_TR; // 0x3c0(0x08)
	struct UImage* IMG_Desc_Reward_01; // 0x3c8(0x08)
	struct UImage* IMG_Desc_Reward_02; // 0x3d0(0x08)
};

