// WidgetBlueprintGeneratedClass UnKnownMarketUpgradeTooltip.UnKnownMarketUpgradeTooltip_C
// Size: 0x3b0 (Inherited: 0x360)
struct UUnKnownMarketUpgradeTooltip_C : UPDUnKnownMarketUpgradeTooltip {
	struct UImage* IMG_Bg01; // 0x360(0x08)
	struct UImage* IMG_Bg02; // 0x368(0x08)
	struct UImage* IMG_Blinder; // 0x370(0x08)
	struct UImage* IMG_Divider_01; // 0x378(0x08)
	struct UImage* IMG_Divider_02; // 0x380(0x08)
	struct UImage* IMG_Mouse_L; // 0x388(0x08)
	struct UImage* IMG_Mouse_R; // 0x390(0x08)
	struct UImage* IMG_MouseGuide_Bg; // 0x398(0x08)
	struct UImage* IMG_Outline; // 0x3a0(0x08)
	struct URetainerBox* RetainerBox_1; // 0x3a8(0x08)
};

