// WidgetBlueprintGeneratedClass UnKnownMarketListItem.UnKnownMarketListItem_C
// Size: 0x568 (Inherited: 0x4e8)
struct UUnKnownMarketListItem_C : UPDUnKnownMarketListItem {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x4e8(0x08)
	struct UWidgetAnimation* Hover; // 0x4f0(0x08)
	struct UImage* IMG_Activate_Bg; // 0x4f8(0x08)
	struct UImage* IMG_Activate_Fx; // 0x500(0x08)
	struct UImage* IMG_Activate_FxBg; // 0x508(0x08)
	struct UImage* IMG_Activate_Outline; // 0x510(0x08)
	struct UImage* IMG_Blink; // 0x518(0x08)
	struct UImage* IMG_BuyBtnBg; // 0x520(0x08)
	struct UImage* IMG_Cancel; // 0x528(0x08)
	struct UImage* IMG_EmptyBg; // 0x530(0x08)
	struct UImage* IMG_Lock_Bg; // 0x538(0x08)
	struct UImage* IMG_Owned_Bg; // 0x540(0x08)
	struct UImage* IMG_Sell_Bg; // 0x548(0x08)
	struct UImage* IMG_SoldOut_Bg; // 0x550(0x08)
	struct UImage* IMG_VXLogo; // 0x558(0x08)
	struct URetainerBox* RB_ItemSlot; // 0x560(0x08)

	void Construct(); // Function UnKnownMarketListItem.UnKnownMarketListItem_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1b61b60
	void ExecuteUbergraph_UnKnownMarketListItem(int32_t EntryPoint); // Function UnKnownMarketListItem.UnKnownMarketListItem_C.ExecuteUbergraph_UnKnownMarketListItem // (Final|UbergraphFunction) // @ game+0x1b61b60
};

