// WidgetBlueprintGeneratedClass UnKnownMarket.UnKnownMarket_C
// Size: 0x900 (Inherited: 0x818)
struct UUnKnownMarket_C : UPDUnKnownMarket {
	struct UWidgetAnimation* Anim_TeamBuff; // 0x818(0x08)
	struct UWidgetAnimation* Anim_LoseCoin; // 0x820(0x08)
	struct UWidgetAnimation* Anim_GetCoin; // 0x828(0x08)
	struct UImage* IMG_CoinIcon; // 0x830(0x08)
	struct UImage* IMG_InvenBg; // 0x838(0x08)
	struct UImage* IMG_InvenDragable_Deco_01; // 0x840(0x08)
	struct UImage* IMG_InvenListDragable; // 0x848(0x08)
	struct UImage* IMG_ItemSlot_BottomLine; // 0x850(0x08)
	struct UImage* IMG_Market_Bg; // 0x858(0x08)
	struct UImage* IMG_Market_MidLine_01; // 0x860(0x08)
	struct UImage* IMG_Market_MidLine_02; // 0x868(0x08)
	struct UImage* IMG_Market_MidLine_03; // 0x870(0x08)
	struct UImage* IMG_Market_OutLine; // 0x878(0x08)
	struct UImage* IMG_Market_Shadow; // 0x880(0x08)
	struct UImage* IMG_Market_TopLine; // 0x888(0x08)
	struct UImage* IMG_MarketTabMenuBg; // 0x890(0x08)
	struct UImage* IMG_PickupDragable_Deco_01; // 0x898(0x08)
	struct UImage* IMG_PickupListDragable; // 0x8a0(0x08)
	struct UImage* IMG_Signature_Guide; // 0x8a8(0x08)
	struct UImage* IMG_SlotTitle_MissionItem_Bg; // 0x8b0(0x08)
	struct UImage* IMG_SlotTitle_MissionItem_BgBg; // 0x8b8(0x08)
	struct UImage* IMG_SlotTitle_Recover_Bg; // 0x8c0(0x08)
	struct UImage* IMG_SlotTitle_Recover_BgBg; // 0x8c8(0x08)
	struct UImage* IMG_SlotTitle_Throw_Bg; // 0x8d0(0x08)
	struct UImage* IMG_SlotTitle_Throw_BgBg; // 0x8d8(0x08)
	struct UImage* IMG_TeamCoinIcon; // 0x8e0(0x08)
	struct UImage* IMG_TooltipCoin; // 0x8e8(0x08)
	struct UImage* IMG_VicinityBg; // 0x8f0(0x08)
	struct UImage* IMG_WeaponSlot_BottomLine; // 0x8f8(0x08)
};

