// WidgetBlueprintGeneratedClass UnKnownMarketTooltip.UnKnownMarketTooltip_C
// Size: 0x480 (Inherited: 0x410)
struct UUnKnownMarketTooltip_C : UPDUnKnownMarketTooltip {
	struct UWidgetAnimation* Show; // 0x410(0x08)
	struct UImage* Img_Bg; // 0x418(0x08)
	struct UImage* IMG_Blinder; // 0x420(0x08)
	struct UImage* IMG_Divider; // 0x428(0x08)
	struct UImage* IMG_Divider_01; // 0x430(0x08)
	struct UImage* IMG_Divider_02; // 0x438(0x08)
	struct UImage* IMG_Divider_03; // 0x440(0x08)
	struct UImage* IMG_Divider_04; // 0x448(0x08)
	struct UImage* IMG_InfoBg; // 0x450(0x08)
	struct UImage* IMG_InfoBg_Pattern; // 0x458(0x08)
	struct UImage* IMG_Mouse_L; // 0x460(0x08)
	struct UImage* IMG_Mouse_R; // 0x468(0x08)
	struct UImage* IMG_Mouse_W; // 0x470(0x08)
	struct UImage* IMG_Outline; // 0x478(0x08)
};

