// WidgetBlueprintGeneratedClass UnKnownMarketWeaponListItem.UnKnownMarketWeaponListItem_C
// Size: 0x538 (Inherited: 0x4e8)
struct UUnKnownMarketWeaponListItem_C : UPDUnKnownMarketListItem {
	struct UWidgetAnimation* Hover; // 0x4e8(0x08)
	struct UImage* IMG_BuyBtnBg; // 0x4f0(0x08)
	struct UImage* IMG_Cancel; // 0x4f8(0x08)
	struct UImage* IMG_EmptyBg; // 0x500(0x08)
	struct UImage* IMG_Lock_Bg; // 0x508(0x08)
	struct UImage* IMG_Owned_Bg; // 0x510(0x08)
	struct UImage* IMG_Sell_Bg; // 0x518(0x08)
	struct UImage* IMG_SoldOut_Bg; // 0x520(0x08)
	struct UImage* IMG_VXLogo; // 0x528(0x08)
	struct URetainerBox* RB_ItemSlot; // 0x530(0x08)
};

