// WidgetBlueprintGeneratedClass UnKnownMarketUpgradeItemSlot.UnKnownMarketUpgradeItemSlot_C
// Size: 0x5b0 (Inherited: 0x4a0)
struct UUnKnownMarketUpgradeItemSlot_C : UPDUnKnownMarketUpgradeItemSlot {
	struct UImage* IMG_Current_ARMORY; // 0x4a0(0x08)
	struct UImage* IMG_Current_DEFENCE; // 0x4a8(0x08)
	struct UImage* IMG_Current_ORDNANCE; // 0x4b0(0x08)
	struct UImage* IMG_Current_TACTICAL; // 0x4b8(0x08)
	struct UImage* IMG_GaugeBg; // 0x4c0(0x08)
	struct UImage* IMG_GaugeOutline; // 0x4c8(0x08)
	struct UImage* IMG_GlowBox_ARMORY; // 0x4d0(0x08)
	struct UImage* IMG_GlowBox_DEFENCE; // 0x4d8(0x08)
	struct UImage* IMG_GlowBox_ORDNANCE; // 0x4e0(0x08)
	struct UImage* IMG_GlowBox_TACTICAL; // 0x4e8(0x08)
	struct UImage* IMG_GlowLine_ARMORY; // 0x4f0(0x08)
	struct UImage* IMG_GlowLine_DEFENCE; // 0x4f8(0x08)
	struct UImage* IMG_GlowLine_ORDNANCE; // 0x500(0x08)
	struct UImage* IMG_GlowLine_TACTICAL; // 0x508(0x08)
	struct UImage* IMG_LevelBg_ARMORY; // 0x510(0x08)
	struct UImage* IMG_LevelBg_DEFENCE; // 0x518(0x08)
	struct UImage* IMG_LevelBg_Off; // 0x520(0x08)
	struct UImage* IMG_LevelBg_ORDNANCE; // 0x528(0x08)
	struct UImage* IMG_LevelBg_TACTICAL; // 0x530(0x08)
	struct UImage* IMG_LockIcon_ARMORY; // 0x538(0x08)
	struct UImage* IMG_LockIcon_DEFENCE; // 0x540(0x08)
	struct UImage* IMG_LockIcon_ORDNANCE; // 0x548(0x08)
	struct UImage* IMG_LockIcon_TACTICAL; // 0x550(0x08)
	struct UImage* IMG_OutLine_ARMORY; // 0x558(0x08)
	struct UImage* IMG_OutLine_DEFENCE; // 0x560(0x08)
	struct UImage* IMG_OutLine_ORDNANCE; // 0x568(0x08)
	struct UImage* IMG_OutLine_TACTICAL; // 0x570(0x08)
	struct UImage* IMG_SlotBg_ARMORY; // 0x578(0x08)
	struct UImage* IMG_SlotBg_DEFENCE; // 0x580(0x08)
	struct UImage* IMG_SlotBg_Else; // 0x588(0x08)
	struct UImage* IMG_SlotBg_First; // 0x590(0x08)
	struct UImage* IMG_SlotBg_Off; // 0x598(0x08)
	struct UImage* IMG_SlotBg_ORDNANCE; // 0x5a0(0x08)
	struct UImage* IMG_SlotBg_TACTICAL; // 0x5a8(0x08)
};

