// WidgetBlueprintGeneratedClass WorldMessage.WorldMessage_C
// Size: 0x388 (Inherited: 0x2f0)
struct UWorldMessage_C : UPDWorldMessageUI {
	struct UWidgetAnimation* EndSysMSG; // 0x2f0(0x08)
	struct UWidgetAnimation* StartSysMSG; // 0x2f8(0x08)
	struct UWidgetAnimation* NumCountDown; // 0x300(0x08)
	struct UPDImage* DecoL1; // 0x308(0x08)
	struct UPDImage* DecoL2; // 0x310(0x08)
	struct UPDImage* DecoR1; // 0x318(0x08)
	struct UPDImage* DecoR2; // 0x320(0x08)
	struct UPDImage* Img_lineb; // 0x328(0x08)
	struct UPDImage* Img_lineB_l; // 0x330(0x08)
	struct UPDImage* Img_lineB_l_2; // 0x338(0x08)
	struct UPDImage* Img_lineB_l_3; // 0x340(0x08)
	struct UPDImage* Img_lineB_l_4; // 0x348(0x08)
	struct UPDImage* IMG_LineGlowD; // 0x350(0x08)
	struct UPDImage* IMG_LineGlowT; // 0x358(0x08)
	struct UPDImage* Img_linet; // 0x360(0x08)
	struct UPDImage* Img_linet_d; // 0x368(0x08)
	struct UPDImage* Img_linet_d_2; // 0x370(0x08)
	struct UPDImage* Img_linet_l; // 0x378(0x08)
	struct UPDImage* Img_linet_l_2; // 0x380(0x08)
};

